{
    "Turnabout_Sisters_part3": {
        "Case_Transcript": [
            "White: Miss May's testimony was correct... as was mine!",
            "White: When you assaulted the girl, she first ran to the left.",
            "White: And then you hit her, savagely! That is what I saw.",
            "White: Next, with the last of her strength, she ran to the right.",
            "White: You chased her, and delivered the final blow.",
            "Phoenix: I present the Mia's Autopsy Report.",
            "Phoenix: Mr. White!",
            "Phoenix: The victim died from a single blow!",
            "White: ...!",
            "Phoenix: What do you have to say to that?",
            "White: Er... Erp!",
            "Phoenix: (Now's my chance to hit him where it counts!)",
            "Phoenix: Mr. White. Wasn't it you who told this court you were \"abso-posi-lutely perfect\"?",
            "White: Mmph.",
            "White: I will refrain from using this phrase from now on.",
            "Phoenix: Your Honor, if you could ask the witness for a new testimony...",
            "Edgeworth: The witness is obviously confused, Your Honor!",
            "Edgeworth: I would like to request a 10 minute break!",
            "Judge: Yes... yes, quite.",
            "Phoenix: The witness is confused because he's lying!",
            "Phoenix: I emphatically request that there be no break, Your Honor!",
            "Judge: If the witness would care to revise his testimony...",
            "Phoenix: (The crowd's on my side! No slipping out of this now, White!)",
            "Judge: Mr. White?",
            "White: O... okay...",
            "White: Umm, well, see--I looked at the other window when I heard that thing fall.",
            "White: Then, the next moment, I saw Miss Mia run to the left!",
            "White: The killer, you, attacked her... but she dodged.",
            "White: Umm... and then...",
            "White: She turned, and ran for the door!",
            "White: Then you did her in with a single blow! Thwap!",
            "Judge: Hmm. \"Thwap\" indeed. Very well, you may begin the cross-examination.",
            "White: Mr. Your Honor... My stomach, you see, it is hurting...",
            "Phoenix: Deal with it. This is almost over.",
            "White: ...!",
            "White: Umm, well, see--I looked at the other window when I heard that thing fall.",
            "Phoenix: You heard \"that thing fall\"? What exactly was \"that thing\"?",
            "White: Huh? Oh... oh, that? Umm... the glass light stand!",
            "Phoenix: (Right... the one that had fallen over at the scene.)",
            "Maya: Phoenix!",
            "Maya: Doesn't something about that strike you as odd?",
            "Phoenix: (Yeah, that is odd. I'll press further.)",
            "Phoenix: Mr. White.",
            "White: Huh? W-what?",
            "Phoenix: You're saying you saw the glass light stand?",
            "White: Y-yes.",
            "Phoenix: Then change your testimony to reflect that!",
            "White: S-sorry. My bad...",
            "Judge: The witness will revise his testimony.",
            "White: A light stand was lying on the floor when I looked.",
            "Phoenix: I present the Glass Shards.",
            "Phoenix: It was impossible for you to have seen the light stand!",
            "White: Whaaaat!?",
            "Phoenix: The stand broke into pieces when it fell!",
            "White: Ooof!",
            "Phoenix: Just by seeing the broken pieces you would have no idea it was a light stand!",
            "Phoenix: So tell me, exactly when was it that you saw the stand?",
            "Phoenix: Answer the question!",
            "White: I-isn't it obvious? I saw the stand before it fell over!",
            "Phoenix: So... you saw the stand before the victim was attacked, then?",
            "White: C-correct! That would be no problemo, right?",
            "Phoenix: (Hmm...)",
            "Phoenix: There's a big problemo, er, I mean problem here.",
            "Phoenix: Mr. White, let me make su",
            "Phoenix: You saw the glass light stand through the window, from the hotel...",
            "Phoenix: before the incident occurred?",
            "White: Correct! That is so! It's conclusive, definitive, undeniable... un",
            "Phoenix: No, it's impossible! You couldn't have seen the stand!",
            "Judge: What? Why couldn't he?",
            "Phoenix: I sure do, Your Honor!",
            "Phoenix: A person in the hotel could not have seen the stand before it fell over!",
            "Phoenix: \"A person in the hotel could not have seen the stand before it fell over!\"",
            "Phoenix: Look at this!",
            "Judge: These are the floor plans to the scene of the murder, yes?",
            "Phoenix: Correct, Your Honor. Now, look...",
            "Phoenix: If you were to look through the window at the office...",
            "Phoenix: This is the area you would be able to see!",
            "Phoenix: Here!",
            "Phoenix: Well...?",
            "Phoenix: Note that the stand is not within the visible area!",
            "Phoenix: Well, Mr. White!",
            "Phoenix: What do you have to say to that!?",
            "White: Er... erp!",
            "White: Ri... dicu... losity...",
            "Phoenix: If you were in the Gatewater Hotel as you claim,",
            "Phoenix: you could not have seen the stand before it fell over!",
            "Phoenix: In fact, you wouldn't have been able to see it after it fell, either!",
            "Phoenix: There's no way you could have recognized the broken shards as a glass light stand!",
            "Phoenix: So, when did you see the stand, Mr. White?",
            "Phoenix: It must have been the moment that it fell!",
            "Phoenix: And the only place you could have seen that from... is inside the Fey Law Offices!",
            "Phoenix: In other words, you were at the scene of the crime, when the murder took place!",
            "White: ...",
            "Phoenix: You did it, didn't you?",
            "White: Mr. Your Honor.",
            "White: I... I... Miss Mia...",
            "Phoenix: (Heh. Looks like we're about to get our verdict!)",
            "Edgeworth: That's far enough, Phoenix Wright!",
            "Phoenix: W-what!? (Urk! I forgot about Edgeworth!)",
            "Edgeworth: Mr. White...",
            "Edgeworth: I think the time has come.",
            "Edgeworth: Shouldn't you confess your crime now, hmm?",
            "White: W... what?",
            "Edgeworth: I said, you should confess your crime.",
            "Edgeworth: Ergo,",
            "Edgeworth: confess that you placed the wiretap!",
            "Phoenix: The w-wiretap!?",
            "Judge: Order! Order",
            "Judge: Mr. Edgeworth! Explain to the court what you mean by this!",
            "Edgeworth: Distinguished members of the court...",
            "Edgeworth: Mr. White is slightly confused.",
            "Edgeworth: Allow me to explain.",
            "Phoenix: (I really don't like the way this is headed...)",
            "Edgeworth: As you know, Mr. White is the CEO of Bluecorp.",
            "Edgeworth: He ordered his secretary, Miss April May, to tap the law offices of Ms. Fey.",
            "Judge: What does that have to do...?",
            "Edgeworth: Your Honor.",
            "Edgeworth: The question is: when was the wiretap placed in the office, and by who?",
            "Phoenix: No! You wouldn't!",
            "Edgeworth: Mr. White.",
            "Edgeworth: In order to place the wiretap, you entered Ms. Fey's office.",
            "Edgeworth: Am I correct...?",
            "White: !",
            "White: C-correct! You are most correct, Miles!",
            "White: Yes... in order to place the wiretap, I bre",
            "White: That is when I saw that accursed light stand!",
            "Judge: Now I'm confus",
            "Edgeworth: Gladly, Your Honor.",
            "Edgeworth: Mr. Phoenix Wright has made his position quite clear.",
            "Edgeworth: He has determined that Mr. White knew the glass stand was in the office.",
            "Edgeworth: He has shown that there was only one time Mr. White could have seen the stand:",
            "Edgeworth: at the very moment of the murder!",
            "Edgeworth: Thus, Mr. Wright would like you to believe that Mr. White was the murderer!",
            "Judge: I see.",
            "Edgeworth: However!",
            "Edgeworth: It is a fact that Mr. White had been to that office well before the murder took place!",
            "Edgeworth: When he went to place the wiretap!",
            "Edgeworth: He could have seen the glass light stand then.",
            "EDGEWORTH: Ergo, Mr. Phoenix Wright's theory is revealed for the baseless conjecture it is!",
            "Judge: Mr. White!",
            "Judge: You will testify to the court about this wiretapping!",
            "White: Ahem. Leave it to me!",
            "Phoenix: (I... I feel faint.)",
            "White: It was the beginning of September... the week before the murder.",
            "White: I had entered the Fey & Co. Law Offices.",
            "White: Of course, I had done so to place the wiretap.",
            "White: That is when I saw this glass light stand.",
            "Judge: Hmm... So, you saw the stand before the night of the incident... And this is how you were able to identify what had fallen over. By the sound?",
            "White: Correct! That is right.",
            "Judge: I see. Very well, Mr. Wright, you may cross-examine.",
            "Phoenix: (Gah! What am I supposed to do now...!?)",
            "Maya: Good luck, Phoenix...",
            "White: It was the beginning of September... the week before the murder.",
            "Phoenix: D-do you have proof!?",
            "Edgeworth: Miss April May knew the details of Ms. Fey's phone conversation!",
            "Edgeworth: This proves that the wiretap was placed before the murder!",
            "Phoenix: Huh... right.",
            "White: I had entered the Fey & Co. Law Offices.",
            "Phoenix: Was it really you that went into the office?",
            "Phoenix: Or was it Miss May?",
            "Edgeworth: Unidentified fingerprints several days old were found in the Fey & Co. Law Offices.",
            "Edgeworth: Those were obviously Mr. White's.",
            "Phoenix: (And if I know Edgeworth, he's already run a check on those prints...)",
            "Edgeworth: Now, Mr. White. Tell us why you went to the Fey & Co. Law Offices.",
            "Phoenix: (Dammit! There's nothing there for me to press him on!)",
            "Phoenix: (Oh well... Maybe he's rattled enough that I can bluff something out of him!)",
            "White: Of course, I had done so to place the wiretap.",
            "Phoenix: Why did you tap Mia's phone!?",
            "Edgeworth: That has no bearing on the current case, Your Honor.",
            "White: Bluecorp is a detective agency of sorts. We have a responsibility to protect client confidentiality!",
            "White: That is when I saw this glass light stand.",
            "Phoenix: Why did you notice something as innocuous as a light stand!?",
            "White: The light stand was made entirely out of glass.",
            "White: It was quite stylish, so I guess it made a lasting impression on me.",
            "White: Such a beautacious thing deserves attention, does it not?",
            "White: That is all.",
            "Phoenix: (Uh oh! Don't tell me I've run out of ammo!)",
            "Edgeworth: Tsk tsk. I'm afraid that's as far as you go, Mr. Wright. The time has come for you to admit your defeat! You fought... honorably.",
            "Phoenix: (No more... I can't take this anymore...)",
            "Judge: Mr. Wright? Are you giving up?",
            "Phoenix: ... Y-yes, Your Honor.",
            "???: (Phoenix!)",
            "Phoenix: ...?",
            "???: (Phoenix! Over here!)",
            "Phoenix: (I know that voice! ... M-Mia!?)",
            "Mia: Never give up, Phoenix!",
            "Phoenix: ...!!!! M-M-Mia...!",
            "Phoenix: Where... Where am I? The waiting lobby...? What happened? ... Oh, right... I lost the trial. I was... hallucinating. ...",
            "Mia: Ah, you're finally awake.",
            "Phoenix: Gak!",
            "Mia: H-hey! Phoenix! ... \"Gak\"? That's no way to greet an old friend! Phoenix, I want you to look at me.",
            "Phoenix: Y-You're... M-Maya...?",
            "Mia: Didn't you know the Fey women have strong psychic powers...? When you accepted your defeat in court... It appears that was enough of a shock to awaken Maya's true powers.",
            "Phoenix: So... Maya is channeling you, Mia?",
            "Mia: That's right. I am Maya, but I'm also Mia. Now, I want you to listen to me, Phoenix. Maya never gave up. You can't either! That's what I came here to tell you.",
            "Phoenix: ...! B-but!",
            "Mia: We don't have much time, Phoenix. Now listen. You've already won.",
            "Phoenix: Huh...?",
            "Mia: You have that Receipt in the court record, right?",
            "Phoenix: Um... oh, yeah! The one you wrote \"Maya\" on...?",
            "Mia: Phoenix! White wrote that, not me!",
            "Phoenix: So... so what do I do with it?",
            "Mia: Look at the front of the receipt!",
            "Phoenix: The... front? (It's a regular receipt... Looks like it's from a famous department store. \"$1,000.00\"... Wow, big spender! \"Item\"... \"glass light stand\"...! \"Date of purchase\"... \"September 4\"...) ...! September 4!",
            "Mia: That's right, Phoenix. I bought that stand the day before I was killed!",
            "Phoenix: Whoa!",
            "Mia: Now, what did Mr. White say in his testimony?",
            "White: It was the beginning of September... the week before the murder.",
            "Phoenix: He said he saw the stand the week before the murder!",
            "Mia: There you go! I think the court is about to reconvene! Go do it, Phoenix! You know you're innocent, now you just have to prove it!",
            "Phoenix: Right!",
            "Judge: The court will now reconvene for the trial of Mr. Phoenix Wright. Is the defendant... rather, are you alright, Mr. Wright?",
            "Phoenix: Yes. Sorry, Your Honor. I'm fine now.",
            "Judge: Then, let's start where we left off.",
            "Edgeworth: Your Honor. There is nothing to go back to! The cross-examination of Mr. White is finished! All that is required now is for you to pass judgment on the defendant Phoenix Wright!",
            "Judge: Hmm...",
            "Phoenix: Your Honor! Please, give me one more chance. I promise you, this is the last time I'll ask you!",
            "Judge: Hmm... But, as Mr. Edgeworth has noted, the trial is more or less finished. Mr. Edgeworth, do you have an opinion on this matter?",
            "Edgeworth: I say... let us give Mr. Phoenix Wright his \"last chance.\"",
            "Judge: Very well! You may begin your cross-examination.",
            "White: It was the beginning of September... the week before the murder",
            "Phoenix: I present the Receipt.",
            "Phoenix: Look closely at this.",
            "Phoenix: See the word \"Maya\" written in blood...?",
            "Edgeworth: Bwah hah! You're grasping!",
            "Phoenix: I think not. Look at the other side of the receipt.",
            "Edgeworth: Th-the other side?",
            "Phoenix: Your Honor.",
            "Phoenix: Would you tell the court what is written on the other side of that receipt?",
            "Judge: Well!",
            "Judge: A \"glass light stand\"!",
            "Judge: And the date of purchase...",
            "Judge: Why, that's the day before the murder!",
            "Phoenix: You see!",
            "Phoenix: When you allegedly entered Fey & Co. Law Offices at the beginning of September...",
            "Phoenix: The stand could not have been there!",
            "White: aaaaaaaaaaaaaa aaaaaaaaaaaaahh!",
            "Phoenix: Well, Mr. White?",
            "Phoenix: Can't get out of this one, can you?",
            "White: No... It's impossachievable...",
            "Phoenix: (Uh oh... he's losing it.)",
            "Phoenix: ...",
            "Phoenix: Well, Your Honor.",
            "Phoenix: I understand there must be quite a bit of PRESSURE on you.",
            "Phoenix: But I think you'll agree you can't judge me \"guilty\" under these circumstances.",
            "Judge: !",
            "Judge: ......",
            "Judge: Very well.",
            "Judge: Then, that is all for the trial of...",
            "Phoenix: Eh?",
            "Phoenix: (What! No way can he worm his way out of this one!)",
            "Phoenix: (Oh wait... I forgot. It's Edgeworth.)",
            "Edgeworth: There is a certain thread of logic to the defendant's claims.",
            "Edgeworth: There is no concrete proof that Phoenix Wright is innocent!",
            "Phoenix: (...!)",
            "Edgeworth: Ergo!",
            "Edgeworth: I would like to request one more day before Phoenix Wright is granted his freedom.",
            "Edgeworth: I need time to make one more inquiry into this matter.",
            "Judge: Hmm...!",
            "Phoenix: (Another inquiry...!?)",
            "Phoenix: (This isn't going to be another one of those \"updated autopsy reports\"!)",
            "Phoenix: (This guy just makes up evidence as he pleases!)",
            "Phoenix: (This is bad...!)",
            "Phoenix: There is no need to prolong this trial any further!",
            "Judge: Hmm.",
            "Judge: Well, Mr. Edgeworth?",
            "EDGEWORTH: If anyone is going to call Mr. White to trial, it would be me, the",
            "Edgeworth: I need a day to ascertain whether these new claims have any basis in factual evidence!",
            "Judge: Objection denied!",
            "Phoenix: Whaaaat!",
            "Judge: The completion of the trial of Mr. Phoenix Wright will be postponed until tomorrow.",
            "Phoenix: (No! There's no telling what will happen if I can't end this now!)",
            "Phoenix: (Edgeworth is sure to come up with--or just make up--something!)",
            "Phoenix: (And after Mia showed up to help me and all...)",
            "White: Mr. Your Honor!",
            "White: May I go home?",
            "Judge: Of course. Thank you for your time.",
            "Phoenix: (Gah!)",
            "Mia: The witness will stay!",
            "Phoenix: (M-Mia...!)",
            "Mia: Phoenix!",
            "Mia: Read this note out loud.",
            "Phoenix: Mia? What's this...?",
            "Phoenix: Your Honor. If I may...?",
            "Judge: You're quite persistent today, Mr. Wright!",
            "Phoenix: (You bet I am! My life is riding on this one!)",
            "Phoenix: I have something I would like to read to the court!",
            "Phoenix: The memo Mia had given me was a list of names.",
            "Phoenix: Many of them sounded strangely familiar.",
            "Phoenix: People in finance, famous celebrities...",
            "Phoenix: That's when it happened.",
            "White: S-s-stop! Desist! Halt!",
            "White: P-please, stop! Make him stop!",
            "White: How... how did you get that list!?",
            "Mia: Mr. White.",
            "Mia: Admit your guilt, right here, right now.",
            "Mia: Or else this list will be released to the press!",
            "White: !!!",
            "White: I",
            "Mia: Case closed, Your Honor.",
            "Judge: Mr. Wright?",
            "Phoenix: Yes, Your Honor.",
            "Judge: You've done it again! That was quite a spirited defense!",
            "Phoenix: I guess you could say that. (If only you knew how \"spirit\"-ed it was!)",
            "Judge: Hmm. Well!",
            "Judge: This court finds the defense...",
            "Judge: Ahem! Rather, the defendant, Mr. Phoenix Wright..."
        ],
        "evidences": [
            "ATTORNEY'S BADGE: No one would believe I was a defense attorney if I didn't carry this.. UI description: ** The evidence is a small, round, metallic object, likely made of gold or brass. It has a distinct, thick, ridged or fluted border that surrounds a central, raised emblem. This central emblem clearly depicts the balanced scales of justice symbol. The object has a polished, shiny appearance, with shading indicating its three-dimensional, disc-like shape.",
            "MIA'S AUTOPSY REPORT: Died from a blow by a blunt object. May have lived for a few minutes after being hit.. UI description: A standard-sized, light brown manila envelope is shown. It is sealed using a traditional string-and-button closure; two dark, circular buttons are visible on the flap and body, with a light-colored string wrapped around them. The envelope appears flat, likely containing papers, and shows no visible markings or damage.",
            "MAYA'S CELL PHONE: Holds a conversation between the Chief and Maya. (September 5, 9:27 AM. Maya: Mia! What's up? You haven't called in a while. Mia: Well, actually there's something I want you to hold on to for me. Maya: Again? What is it this time? Mia: It's... a clock. It's made to look like that statue, 'The Thinker.' And it tells you the time! Ah... I should probably tell you, the clock isn't talking right now. Maya: Huh? It's not working? That's lame! Mia: I had to take the clockwork out, sorry. I put some papers inside it instead. Maya: Papers? Is that the evidence, then? Mia: I'll leave that one up to your imagination. See you tonight at nine.). UI description: The evidence is a purple flip-style cell phone, shown in its open state. It features a dark grey screen and a silver keypad with numerous small buttons. A short antenna protrudes from the top right. Attached to the top left corner is a matching purple strap or lanyard. The phone appears to be made of plastic and shows no obvious damage.",
            "GLASS SHARDS: The broken remains of a glass light stand. Broken beyond all recognition.. UI description: The evidence icon displays several irregularly shaped, white fragments scattered against a plain grey background. The pieces vary in size, with some larger flat shards and smaller slivers. They have sharp, clearly broken edges. Highlights and subtle shading give them a slightly reflective appearance, consistent with broken glass.",
            "THE THINKER: The murder weapon. Looks like a statue, but it's actually a clock. Made by Larry Butz.. UI description: A small, metallic, bronze-colored statuette of a seated male figure resting his chin on his right hand, with his right elbow on his left knee. The figure sits atop an uneven surface, mimicking a rock. This entire sculpture is mounted on a plain, white, rectangular pedestal. On the front face of the white pedestal, there is a small, dark, horizontal rectangular indentation or slot.",
            "WIRETAP: Found in Miss May's hotel room.. UI description: The evidence displayed is a small, black, rectangular plastic-looking box. Extending from one side are two flexible black wires that loop back towards the box. Each wire ends with a small, distinct, gold-colored metallic tip or contact point. The main body of the box appears solid and smooth.",
            "RECEIPT: A department store receipt with letters written in blood on the back.. UI description: A small, roughly rectangular piece of white paper, appearing slightly crumpled or folded. On its surface, the name \"Maya\" is written in large, somewhat uneven letters using a thick, red substance that resembles blood. An exclamation mark follows the name, also rendered in the same red substance. The writing style looks somewhat rushed or erratic, and the red substance appears slightly smeared or absorbed into the paper. The edges of the paper are not perfectly straight.",
            "MAY TESTIMONY: \"The victim dodged an attack then ran to the right, but she was caught and struck.\". UI description: The evidence item is a long, narrow, rectangular object, primarily white in color. It appears to be made of paper and is folded lengthwise down the center. One end looks slightly thicker, as if another piece of paper is tucked inside or it's folded over multiple times. There are no visible markings, text, or damage on its surface.",
            "FLOOR PLANS: The murder scene, the Fey & Co. Law Offices. (The room is viewed from above, split into a lit center and darker corners. A door is at the top-right, and a large window is along the top wall, casting a cone-shaped beam of light inward. In the bottom-left, a plant has been knocked over near a fallen object, with debris scattered into the light. Two pieces of furniture (likely chairs) are overturned in the middle of the room. From the window’s perspective, only the right half of the room is clearly visible—especially the plant debris and doorway area. The far-left corner (where the struggle likely began) is obscured from view, suggesting a witness outside the window could misjudge the victim’s movements.)",
            "Mia's Memo: A list of people's names in Mia's handwriting.. UI description: A light-colored document filled with typed text, viewed at an angle, displayed on a gray background within a highlighted evidence slot."
        ],
        "prev_responses": [
            "game_state: Conversation\nmove: z\nthought: continue conversation",
            "game_state: Conversation\nmove: z\nthought: continue conversation",
            "game_state: Conversation\nmove: z\nthought: continue conversation",
            "game_state: Conversation\nmove: z\nthought: continue conversation",
            "game_state: Conversation\nmove: z\nthought: continue conversation",
            "game_state: Conversation\nmove: z\nthought: continue conversation",
            "game_state: Conversation\nmove: z\nthought: continue conversation",
            "game_state: Conversation\nmove: z\nthought: continue conversation",
            "game_state: Conversation\nmove: z\nthought: continue conversation",
            "game_state: Conversation\nmove: z\nthought: continue conversation",
            "game_state: Conversation\nmove: z\nthought: continue conversation",
            "game_state: Conversation\nmove: z\nthought: continue conversation",
            "game_state: Conversation\nmove: z\nthought: continue conversation",
            "game_state: Conversation\nmove: z\nthought: continue conversation"
        ]
    }
}