{
    "The First Turnabout": {
        "Case_Transcript": [
            "Phoenix: (Boy am I nervous!)",
            "Mia: Wright!",
            "Phoenix: Oh, h-hiya, Chief.",
            "Mia: Whew, I'm glad I made it on time. Well, I have to say Phoenix, I'm impressed! Not everyone takes on a murder trial right off the bat like this. It says a lot about you... and your client as well.",
            "Phoenix: Um... thanks. Actually, it's because I owe him a favor.",
            "Mia: A favor? You mean, you knew the defendant before this case?",
            "Phoenix: Yes. Actually, I kind of owe my current job to him. He's one of the reasons I became an attorney.",
            "Mia: Well, that's news to me!",
            "Phoenix: I want to help him out any way I can! I just... really want to help him. I owe him that much.",
            "???: (It's over! My life, everything, it's all over!)",
            "Mia: ... Is that your client screaming over there?",
            "Phoenix: Yeah... it's him.",
            "???: (Death! Despair! Ohhhh! I'm gonna do it, I'm gonna die!!!)",
            "Mia: It sounds like he wants to die...",
            "Phoenix: Um, yeah. *sigh*",
            "Butz: Nick!!!",
            "Phoenix: Hey. Hey there, Larry.",
            "Butz: Dude, I'm so guilty!! Tell them I'm guilty!!! Gimme the death sentence! I ain't afraid to die!",
            "Phoenix: What!? What's wrong, Larry?",
            "Butz: Oh, it's all over... I... I'm finished. Finished! I can't live in a world without her! I can't! Who... who took her away from me, Nick? Who did this!? Aww, Nick, ya gotta tell me! Who took my baby away!?",
            "Phoenix: (Hmm... The person responsible for your girlfriend's death? The newspapers say it was you...)",
            "Phoenix: My name is Phoenix Wright. Here's the story: My first case is a fairly simple one. A young woman was killed in her apartment. The guy they arrested was the unlucky sap dating her: Larry Butz... my best friend since grade school. Our school had a saying: \"When something smells, it's usually the Butz.\" In the 23 years I've known him, it's usually been true. He has a knack for getting himself in trouble. One thing I can say though: it's usually not his fault. He just has terrible luck. But I know better than anyone, that he's a good guy at heart. That and I owe him one. Which is why I took the case... to clear his name. And that's just what I'm going to do!",
            "Scene: August 3, 10:00 AM",
            "Scene: District Court",
            "Scene: Courtroom No. 2",
            "Judge: Court is now in session for the trial of Mr. Larry Butz.",
            "Payne: The prosecution is ready, Your Honor.",
            "Phoenix: The, um, defense is ready, Your Honor.",
            "Judge: Ahem. Mr. Wright? This is your first trial, is it not?",
            "Phoenix: Y-Yes, Your Honor. I'm, um, a little nervous.",
            "Judge: Your conduct during this trial will decide the fate of your client. Murder is a serious charge. For your client's sake, I hope you can control your nerves.",
            "Phoenix: Thank... thank you, Your Honor.",
            "Judge: ... Mr. Wright, given the circumstances... I think we should have a test to ascertain your readiness.",
            "Phoenix: Yes, Your Honor. (Gulp... Hands shaking... Eyesight... fading...)",
            "Judge: The test will consist of a few simple questions. Answer them clearly and concisely. Please state the name of the defendant in this case.",
            "Phoenix: The defendant? Well, that's Larry Butz, Your Honor.",
            "Judge: Correct. Just keep your wits about you and you'll do fine. Next question: This is a murder trial. Tell me, what's the victim's name?",
            "Phoenix: (Whew, I know this one! Glad I read the case report cover to cover so many times. It's... wait... Uh-oh! No... no way! I forgot! I'm drawing a total blank here!)",
            "Mia: Phoenix! Are you absolutely SURE you're up to this? You don't even know the victim's name!?",
            "Phoenix: Oh, the victim! O-Of course I know the victim's name! I, um, just forgot. ...Temporarily.",
            "Mia: I think I feel a migraine coming on. Look, the victim's name is listed in the Court Record. Just press [the R Button / Tab] to check it at any time, okay? Remember to check it often. Do it for me, please. I'm begging you.",
            "Judge: Mr. Wright. Who is the victim in this case?",
            "Phoenix: Um... the victim's name is Cindy Stone.",
            "Judge: Correct. Now, tell me, what was the cause of death? She died because she was...?",
            "Phoenix: She was struck once, by a blunt object.",
            "Judge: Correct. You've answered all my questions. I see no reason why we shouldn't proceed. You seem much more relaxed, Mr. Wright. Good for you.",
            "Phoenix: Thank you, Your Honor. (Because I don't FEEL relaxed, that's for sure.)",
            "Judge: Well, then... First, a question for the prosecution. Mr. Payne?",
            "Payne: Yes, Your Honor?",
            "Judge: As Mr. Wright just told us, the victim was struck with a blunt object. Would you explain to the court just what that \"object\" was?",
            "Payne: The murder weapon was this statue of \"The Thinker.\" It was found lying on the floor, next to the victim.",
            "Judge: I see... The court accepts it into evidence.",
            "Narration: Statue added to the Court Record.",
            "Mia: Wright... Be sure to pay attention to any evidence added during the trial. That evidence is the only ammunition you have in court. Use [the R Button / Tab] to check the Court Record frequently.",
            "Judge: Mr. Payne, the prosecution may call its first witness.",
            "Payne: The prosecution calls the defendant, Mr. Butz, to the stand.",
            "Phoenix: Um, Chief, what do I do now?",
            "Mia: Pay attention. You don't want to miss any information that might help your client's case. You'll get your chance to respond to the prosecution later, so be ready! Let's just hope he doesn't say anything... unfortunate.",
            "Phoenix: (Uh oh, Larry gets excited easily... This could be bad.)",
            "Payne: Ahem. Mr. Butz. Is it not true that the victim had recently dumped you?",
            "Butz: Hey, watch it buddy! We were great together! We were Romeo and Juliet, Cleopatra and Mark Anthony!",
            "Phoenix: (Um... didn't they all die?)",
            "Butz: I wasn't dumped! She just wasn't taking my phone calls. Or seeing me... Ever. WHAT'S IT TO YOU, ANYWAY!?",
            "Payne: Mr. Butz, what you describe is generally what we mean by \"dumped.\" In fact, she had completely abandoned you... and was seeing other men! She had just returned from overseas with one of them the day before the murder!",
            "Butz: Whaddya mean, \"one of them\"!? Lies! All of it, lies! I don't believe a word of it!",
            "Payne: Your Honor, the victim's passport. According to this, she was in Paris until the day before she died.",
            "Narration: Passport added to the Court Record.",
            "Judge: Hmm... Indeed, she appears to have returned the day before the murder.",
            "Butz: Dude... no way...",
            "Payne: The victim was a model, but did not have a large income. It appears that she had several \"Sugar Daddies.\"",
            "Butz: Daddies? Sugar?",
            "Payne: Yes. Older men, who gave her money and gifts. She took their money and used it to support her lifestyle.",
            "Butz: Duuude!",
            "Payne: We can clearly see what kind of woman this Ms. Stone was. Tell me, Mr. Butz, what do you think of her now?",
            "Mia: Wright... I don't think you want him to answer that question.",
            "Phoenix: (Yeah... Larry has a way of running his mouth in all the wrong directions. Should I...?)",
            "Butz: I'm gonna die. I'm just gonna drop dead! Yeah, and when I meet her in the afterlife... I'm going to get to the bottom of this!",
            "Judge: Let's continue with the trial, shall we?",
            "Payne: I believe the accused's motive is clear to everyone.",
            "Judge: Yes, quite.",
            "Phoenix: (Oh boy. This is so not looking good.)",
            "Payne: Next question! You went to the victim's apartment on the day of the murder, did you not?",
            "Butz: Gulp!",
            "Payne: Well, did you, or did you not?",
            "Butz: Heh? Heh heh. Well, maybe I did, and maybe I didn't!",
            "Phoenix: (Uh oh. He went. What do I do?)",
            "Judge: Well, that simplifies matters. Who is your witness?",
            "Payne: The man who found the victim's body. Just before making the gruesome discovery... He saw the defendant fleeing the scene of the crime!",
            "Judge: Order! Order in the court! Mr. Payne, the prosecution may call its witness.",
            "Payne: Yes, Your Honor.",
            "Phoenix: (This is bad...)",
            "Payne: On the day of the murder, my witness was selling newspapers at the victim's building. Please bring Mr. Frank Sahwit to the stand!",
            "Payne: Mr. Sahwit, you sell newspaper subscriptions, is this correct?",
            "Sahwit: Oh, oh yes! Newspapers, yes!",
            "Judge: Mr. Sahwit, you may proceed with your testimony. Please tell the court what you saw on the day of the murder.",
            "Sahwit: I was going door-to-door, selling subscriptions when I saw a man fleeing an apartment.",
            "Sahwit: I thought he must be in a hurry because he left the door half-open behind him.",
            "Sahwit: Thinking it strange, I looked inside the apartment.",
            "Sahwit: Then I saw her lying there... A woman... not moving... dead!",
            "Sahwit: I quailed in fright and found myself unable to go inside.",
            "Sahwit: I thought to call the police immediately!",
            "Sahwit: However, the phone in her apartment wasn't working.",
            "Sahwit: I went to a nearby park and found a public phone.",
            "Sahwit: I remember the time exactly: It was 1:00 PM.",
            "Sahwit: The man who ran was, without a doubt, the defendant sitting right over there.",
            "Judge: Hmm...",
            "Phoenix: (Larry! Why didn't you tell the truth? I can't defend you against a testimony like that!)",
            "Judge: Incidentally, why wasn't the phone in the victim's apartment working?",
            "Payne: Your Honor, at the time of the murder, there was a blackout in the building.",
            "Judge: Aren't phones supposed to work during a blackout?",
            "Payne: Yes, Your Honor... However, some cordless phones do not function normally. The phone that Mr. Sahwit used was one of those. Your Honor... I have a record of the blackout, for your perusal.",
            "Narration: Blackout Record added to the Court Record.",
            "Judge: Now, Mr. Wright...",
            "Phoenix: Yes! Er... yes, Your Honor?",
            "Judge: You may begin your cross-examination.",
            "Phoenix: C-Cross-examination, Your Honor?",
            "Mia: Alright, Wright, this is it. The real deal!",
            "Phoenix: Uh... what exactly am I supposed to do?",
            "Mia: Why, you expose the lies in the testimony the witness just gave!",
            "Phoenix: Lies! What?! He was lying!?",
            "Mia: Your client is innocent, right? Then that witness must have lied in his testimony! Or is your client really... guilty?",
            "Phoenix: !!! How do I prove he's not?",
            "Mia: You hold the key! It's in the evidence! Compare the witness's testimony to the evidence at hand. There's bound to be a contradiction in there! First, find contradictions between the Court Record and the witness's testimony. Then, once you've found the contradicting evidence... present it and rub it in the witness's face!",
            "Phoenix: Um... okay.",
            "SAHWIT: I was going door-to-door, selling subscriptions when I saw a man fleeing an apartment.",
            "SAHWIT: I thought he must be in a hurry because he left the door half-open behind him.",
            "SAHWIT: Thinking it strange, I looked inside the apartment.",
            "SAHWIT: Then I saw her lying there... A woman... not moving... dead!",
            "SAHWIT: I quailed in fright and found myself unable to go inside.",
            "SAHWIT: I thought to call the police immediately!",
            "SAHWIT: However, the phone in her apartment wasn't working.",
            "SAHWIT: I went to a nearby park and found a public phone.",
            "SAHWIT: I remember the time exactly: It was 1:00 PM.",
            "SANWIT: I remember the time exactly: It was 1:00 PM.",
            "Phoenix: You found the body at 1:00 PM.",
            "Phoenix: You found the body at 1:00 PM. You're sure?",
            "Sahwit: Yes. It was 1:00 PM, for certain.",
            "Phoenix: Frankly, I find that hard to believe!",
            "Phoenix: Your statement directly contradicts the autopsy report.",
            "Phoenix: The autopsy notes the time of death at sometime after 4PM.",
            "Phoenix: There was nobody to... er... no \"body\" to find",
            "Phoenix: There was nobody to... er... no \"body\" to find at 1:00 PM!",
            "Phoenix: How do you explain this three-hour gap?",
            "Sahwit: !!!",
            "Sahwit: Oh, that! Oh, er...",
            "Payne: This is trivial! The witness merely forgot",
            "Payne: This is trivial! The witness merely forgot the time!",
            "Judge: After his testimony, I find that hard t",
            "Judge: After his testimony, I find that hard to believe.",
            "Judge: Mr. Sahwit...",
            "Judge: Why were you so certain that you found the body at 1:00 PM?",
            "Sahwit: I... er... well, I... Gee,",
            "Sahwit: I... er... well, I... Gee, that's a really good question!",
            "Mia: Great job, Wright! Way to put him on the spot!",
            "Mia: That's all you have to do: point out contradictions!",
            "Mia: Lies always beget more lies!",
            "Mia: See through one, and their whole story falls apart!",
            "Sahwit: Wait! I remember now!",
            "Judge: Would you care to give your testimony again?",
            "Sahwit: You see, when I found the body, I heard the time.",
            "Sahwit: There was a voice saying the time... It was probably coming from the television.",
            "Sahwit: Oh, but it was three hours off, wasn't it?",
            "Sahwit: I guess the victim must have been watching a video of a taped program!",
            "Sahwit: That's why I thought it was 1:00 PM!",
            "Sahwit: Terribly sorry about the misunderstanding...",
            "Judge: Hmm",
            "Judge: Hmm... I see. You heard a voice say",
            "Judge: Hmm... I see. You heard a voice saying the time on a taped program.",
            "Judge: Mr. Wright, you may cross-examine the witness.",
            "Mia: You know what to do!",
            "Phoenix: I've got this one.",
            "Sanwit: You see, when I found the body, I heard the time.",
            "Witness: You see, when I found the body, I heard the time.",
            "WITNESS: You see, when I found the body, I heard the time.",
            "Phoenix: Your Ho",
            "Phoenix: Your Honor! That statement contradicts this evidence!",
            "Judge: ...?",
            "Judge: It does? I don't see anything contradictory...",
            "Phoenix: Huh? Really?",
            "Judge: Objection overruled.",
            "Judge: Try to think before you make accusations, Mr. Wright!",
            "Phoenix: (Whoops! That didn't go so well.)",
            "SANWIT: You see, when I found the body, I heard the time.",
            "Phoenix: Hold it right there!",
            "Phoenix: The prosecution has said there was a blackout at the time of the discovery!",
            "Phoenix: And this record proves it!",
            "Sahwit: ...!",
            "Phoenix: You couldn't have heard a television...",
            "Phoenix: You couldn't have heard a television... or a video!",
            "Sahwit: Gah!!!",
            "Sahwit: I... well... urk!",
            "Judge: The defense has a point.",
            "Judge: Do you have an explanation for this, Mr. Sahwit?",
            "Sahwit: No, I... I find it quite puzzling myself! Quite!",
            "Sahwit: ...",
            "Sahwit: W-wait! I remember now!",
            "Judge: Mr. Sahwit?",
            "Judge: The court would prefer to hear an accurate testimony from the very beginning.",
            "Judge: These constant corrections are harming your credibility.",
            "Judge: That, and you seem rather... distraught.",
            "Sahwit: M-my apologies, Your Honor!",
            "Sahwit: It... er, it must have been the shock of finding the body!",
            "Judge: Very well, Mr. Sahwit.",
            "Judge: Let's hear your testimony once more please.",
            "Sahwit: Actually, I didn't \"hear\" the time... I \"saw\" it!",
            "Sahwit: There was a table clock in the apartment, wasn't there!",
            "Sahwit: Yeah, the murder weapon! The killer used it to hit the victim!",
            "Sahwit: That must have been what I saw.",
            "Judge: You saw a clock?",
            "Judge: You saw a clock? I guess that would explain it.",
            "Judge: The defense may cross-examine the witness.",
            "Phoenix: Gladly.",
            "Phoenix: That strikes me as a very suspicious mistake.",
            "Sahwit: Yes, I can see how you'd be a little doubtful...",
            "Sahwit: I'm really sorry. I only just remembered that table clock!",
            "Judge: A \"table clock\"?",
            "(Unknown speaker): There was a table clock in the apartment, wasn't there!",
            "Sanwit: There was a table clock in the apartment, wasn't there!",
            "SANWIT: There was a table clock in the apartment, wasn't there!",
            "Unknown speaker: There was a table clock in the apartment, wasn't there!",
            "Phoenix: Wait just a moment!",
            "Phoenix: The murder weapon wasn't a clock",
            "Phoenix: The murder weapon wasn't a clock. It was this statue!",
            "Phoenix: Now how is this supposed to be a clock?",
            "Sahwit: Y-you with your \"objections,\" and your \"evidence\"...",
            "Sahwit: Y-you with your \"objections,\" and your \"evidence\"... Just who do you think you are!?",
            "Phoenix: Just answer the question, Mr. Sahwit.",
            "Sahwit: Hey, I... I saw it there, okay! That's a clock!",
            "PAYNE: Your Honor! If I may...",
            "Payne: Your Honor! If I may...",
            "Judge: Yes, Mr. Payne?",
            "Payne: As the witness stated, this statue is indeed a clock.",
            "Payne: The neck is a switch. You just tilt it, and it says the time out loud.",
            "Payne: As it doesn't look like a clock, I submitted it as a statue. My apologies.",
            "Judge: I see.",
            "Judge: So the murder weapon was a table clock after all.",
            "Judge: Well, Mr. Wright?",
            "Judge: It appears that the witness's testimony was correct. This is a clock.",
            "Judge: Do you have any problems with his testimony now?",
            "Phoenix: I guess not.",
            "Phoenix: There was a clock on the scene, so, no problem.",
            "Mia: Wright! Are you out of your mind!?",
            "Mia: That clock doesn't look like a clock at all!",
            "Mia: The witness couldn't have possibly known it was a clock just by seeing it!",
            "Mia: He said himself, he never entered the apartment!",
            "Mia: It was in his testimony!",
            "Judge: Is something the matter? Does the defense have anything to add?",
            "Phoenix: Yes...",
            "Phoenix: Yes... Yes I do!",
            "Phoenix: The only way he could have known the weapon was a clock is to hold it in his hand.",
            "Phoenix: Yet the witness testified that he never entered the apartment!",
            "Phoenix: Clearly, a contradiction!",
            "Judge: Hmm... indeed!",
            "Phoenix: The witness knew it was a clock, because he...",
            "Phoenix: You're lying!",
            "Phoenix: You were inside the apartment on the day of the murder!",
            "Sahwit: Oh yeah? Prove it! Prove I went in there!",
            "Phoenix: I'll do better than that! I can prove you were the one who killed her!",
            "Phoenix: I'll do better than that! I can prove you were the",
            "Phoenix: You struck her with the clock, and the shock of the blow triggered the clock's voice!",
            "Phoenix: That was the sound you heard!",
            "Judge: Order",
            "Judge: Order in the court!",
            "Judge: Intriguing. Please continue, Mr. Wright.",
            "Phoenix: Yes, Your Honor.",
            "Phoenix: Mr. Sahwit.",
            "Phoenix: The sound must have left quite an impression on you.",
            "Phoenix: Understandable, since the murder",
            "Phoenix: Understandable, since the murder weapon spoke just as you hit the victim!",
            "Phoenix: That voice was burned into your mind.",
            "Phoenix: That's why you were so certain about the time!",
            "Payne: W-w-what's the meaning of this?",
            "Payne: This is all baseless conjecture!",
            "Phoenix: Baseless...?",
            "Phoenix: Just look at the witness's face!",
            "Sahwit: Ngh... grrrah!",
            "Judge: Would the witness care to elaborate?",
            "Judge: Did you strike the victim with the clock?",
            "Sahwit: I... I...! That... that day... I... I never!",
            "Sahwit: I-it was him, I tell you! I saw him!",
            "Sahwit: H-he killed her and he should burn! Burn! Give him death!",
            "Judge: Orde",
            "Payne: Your Honor, a-a moment please!",
            "Payne: There isn't a shred of evidence supporting the defense's claims!",
            "Judge: Mr. Wright!",
            "Phoenix: Your Honor?",
            "Judge: You claim the sound the witness heard came from the clock...",
            "Judge: Do you have any evidence?",
            "Phoenix: (The whole case is riding on this! I'd better think it through carefully!)"
        ],
        "evidences": [
            "ATTORNEY'S BADGE: No one would believe I was a defense attorney if I didn't carry this.",
            "CINDY'S AUTOPSY REPORT: Time of death: 7/31, 4PM - 5PM. Cause of death: loss of blood due to blunt trauma.",
            "STATUE: A statue in the shape of \"The Thinker.\" It's rather heavy.",
            "PASSPORT: The victim apparently arrived home from Paris on 7/30, the day before the murder.",
            "BLACKOUT RECORD: Electricity to Ms. Stone's building was out from noon to 6PM on the day of the crime."
        ],
        "prev_responses": [
            "game_state: Conversation\nmove: z\nthought: Payne just interrupted the Judge. I need to advance the dialogue to hear what he has to say.",
            "game_state: Conversation\nmove: z\nthought: Payne just claimed I have no evidence to support my claim that Sahwit is the killer. I need to advance the dialogue to see how the court responds to this.",
            "game_state: Conversation\nmove: z\nthought: Payne just objected, saying I have no proof for my accusation against Sahwit. The Judge is now addressing me, likely asking for that proof. I need to advance the dialogue to see what the Judge says.",
            "game_state: Conversation\nmove: z\nthought: The Judge just asked me a question after Payne objected. I need to advance the dialogue to hear the full question or the next line.",
            "game_state: Conversation\nmove: z\nthought: The Judge is asking me to confirm my claim about the clock's sound. I need to advance the dialogue to see the full question and continue the scene.",
            "game_state: Conversation\nmove: z\nthought: The Judge is asking for evidence to back up my claim about the clock making the sound. I need to advance the dialogue to respond or see what happens next.",
            "game_state: Conversation\nmove: z\nthought: The Judge asked me for evidence to support my theory about the clock making a sound when Sahwit used it as a weapon. I need to advance the dialogue to continue this critical part of the trial."
        ]
    }
}