{
    "The First Turnabout": {
        "Case_Transcript": [
            "SAHWIT: I was going door-to-door, selling subscriptions when I saw a man fleeing an apartment.",
            "Phoenix: Isn't a man leaving an apartment a common sigh",
            "Phoenix: Isn't a man leaving an apartment a common sight?",
            "Phoenix: I find it odd you would take notice of him...",
            "SAHWIT: Er... heh.",
            "SAHWIT: I don't know. He just seemed strange to me, that's all.",
            "Sahwit: Like he was mad, and yet frightened at the same time.",
            "SAHWIT: Just like... a criminal fleeing the scene of a crime!",
            "Phoenix: The defense requests that the witness refrain from conjecture!",
            "PAYNE: Of course. What the witness means is that the man he saw looked susp",
            "Payne: So, what happened next?",
            "SAHWIT: I thought he must be in a hurry because he left the door half-open",
            "Phoenix: Half-open... you say?",
            "SAHWIT: Yes, yes, the door was open halfway. Yes.",
            "Sahwit: I watched for a moment, but no one came to close the door.",
            "Sahwit: \"That's odd, in a big city like this,\" I thought...",
            "Payne: I see. And what happened next?",
            "Sahwit: Thinking it strange, I looked inside the apartment.",
            "Phoenix: What gave you the idea to do that?",
            "Sahwit: Well, the door was half-open, you see.",
            "SAHWIT: Isn't it only human to want to... peek?",
            "SAHWIT: We climb mountains because they are there! It's the same thing.",
            "PAYNE: Truer words have never been spoken! Anyone would look inside!",
            "Phoenix: (Hmm... why did Payne cut him off so quickly?)",
            "Payne: So, you looked into the apartment. What happened then?",
            "SAHWIT: Then I saw her lying there... A woman... not moving... dead!",
            "Phoenix: Are you sure",
            "Sahwit: W-Well, no, I guess I wasn't.",
            "Sahwit: But, she wasn't moving at all, and there was blood everywhere.",
            "Phoenix: (I guess that would look fatal to anyone...)",
            "Phoenix: Very well, what happened next?",
            "SAHWIT: I quailed in fright and found myself unable to go inside.",
            "Phoenix: So, you didn't touch ANYTHING",
            "Sahwit: Um, yes. I mean no! Nothing.",
            "Phoenix: Okay. What happened next?",
            "SAHWIT: I thought to call the police immediately!",
            "Sahwit: I thought to call the police immediately!",
            "Phoenix: You \"thought\"",
            "Payne: Please, please... Listen to the rest of the testimony.",
            "Payne: You thought to call the police... What happened next?",
            "Sahwit: However, the phone in her apartment wasn't working.",
            "Phoenix: The phone in her apartment wasn't working?",
            "Sahwit: Yes. I mean, no. No, it wasn't. Right.",
            "Phoenix: But you said you didn't go into the apartment... or did you!?",
            "Sahwit: Oh, oh, that? I can explain that!",
            "Sahwit: There was a cordless phone on a shelf in the entranceway.",
            "Sahwit: I reached inside and tried using that to call...",
            "PAYNE: And that phone wasn't working, correct?",
            "PAYNE: What happened next?",
            "SAHWIT: I went to a nearby park and found a public phone.",
            "Phoenix: Why use a public phone?",
            "Sahwit: Well, you see, I don't have a cell phone.",
            "Sahwit: And, being the middle of the afternoon, there was no answer at the nearby apartments.",
            "Phoenix: Ah, right... what time did you call again?",
            "SAHWIT: I remember the time exactly: It was 1:00 PM.",
            "WITNESS: I remember the time exactly: It was 1:00 PM.",
            "Phoenix: You found the body at 1:00 PM.",
            "SAHWIT: Yes. It was 1:00 PM, for certain.",
            "Phoenix: Frankly, I find that hard to believe!",
            "Phoenix: Your statement directly contradicts the autopsy report.",
            "Phoenix: The autopsy notes the time of death at sometime after 4PM.",
            "Phoenix: There was nobody to... er... no \"body\" to fin",
            "Phoenix: How do you explain this three-hour gap?",
            "Sahwit: !!!",
            "Sahwit: Oh, that! Oh, er...",
            "Payne: This is trivial! The witness merely for",
            "Judge: After his testimony, I find that hard",
            "Judge: Mr. Sahwit...",
            "Judge: Why were you so certain that you found the body at 1:00 PM?",
            "Sahwit: I... er... well, I... Gee,",
            "MIA: Great job, Wright! Way to put him on the spot!",
            "MIA: That's all you have to do: point out contradictions!",
            "MIA: Lies always beget more lies!",
            "MIA: See through one, and their whole story falls apart!",
            "Sahwit: Wait! I remem",
            "Judge: Would you care to give your testimony again?",
            "SAHWIT: You see, when I found the body, I heard the time.",
            "SAHWIT: There was a voice saying the time... It was probably coming from the television.",
            "SAHWIT: Oh, but it was three hours off, wasn't it?",
            "SAHWIT: I guess the victim must have been watching a video of a taped program!",
            "SAHWIT: That's why I thought it was 1:00 PM!",
            "SAHWIT: Terribly sorry about the misunderstanding...",
            "Judge: Hmm",
            "Judge: Mr. Wright, you may cross-examine the witness.",
            "MIA: Wright!",
            "MIA: You know what to do!",
            "Phoenix: I've got this one.",
            "WITNESS: You see, when I found the body, I heard the time."
        ],
        "evidences": [
            "ATTORNEY'S BADGE: No one would believe I was a defense attorney if I didn't carry this.",
            "CINDY'S AUTOPSY REPORT: Time of death: 7/31, 4PM - 5PM. Cause of death: loss of blood due to blunt trauma.",
            "STATUE: A statue in the shape of \"The Thinker.\" It's rather heavy.",
            "PASSPORT: The victim apparently arrived home from Paris on 7/30, the day before the murder.",
            "BLACKOUT RECORD: Electricity to Ms. Stone's building was out from noon to 6PM on the day of the crime."
        ],
        "prev_responses": [
            "game_state: Conversation\nmove: enter\nthought: I'm in Conversation mode according to the current game state, so I should use confirm to continue the dialogue. Mia has just said \"Wright! You know what to do!\" which is encouraging me to proceed with the cross-examination of Sahwit's new testimony. This is a critical moment in the trial as I'm about to begin cross-examining Sahwit's claims that he heard the time from a television that was playing a taped program that was three hours off. I've already identified a major contradiction with our evidence - specifically the Blackout Record, which shows electricity to Ms. Stone's building was out from noon to 6PM on the day of the crime. This means no television could have been working at 1:00 PM when Sahwit claims to have found the body. By confirming now, I'll advance the dialogue and likely enter cross-examination mode where I can expose this contradiction. I'm preparing to use the Blackout Record to completely undermine Sahwit's revised testimony, which could reveal him as the true culprit and help prove Larry's innocence. Once I enter cross-examination mode, I'll need to carefully press or present evidence at the right moment to expose the contradiction.",
            "game_state: Conversation\nmove: enter\nthought: I'm in Conversation mode according to the current game state, so I should use confirm to continue the dialogue. I've just said \"I've got this one\" in response to Mia's encouragement. This indicates I'm ready to begin the cross-examination of Sahwit's new testimony. I've already identified a critical contradiction in his testimony - he claims he heard the time from a television at 1:00 PM, but according to the Blackout Record in our evidence, electricity to Ms. Stone's building was out from noon to 6PM on the day of the crime. This means no television could have been working at 1:00 PM. By confirming now, I'll advance the dialogue and likely enter cross-examination mode where I can expose this contradiction. Once I enter cross-examination mode, I'll need to carefully listen to each statement and present the Blackout Record when Sahwit mentions hearing the time from the television. This contradiction could be the key to revealing Sahwit as the true culprit and proving Larry's innocence.",
            "game_state: Cross-Examination\nmove: l\nthought: I'm in Cross-Examination mode according to the current game state. The witness, Mr. Sahwit, has given a new testimony to explain the time discrepancy I exposed earlier. Looking at the testimony context, I need to find the statement where he mentions hearing the time from a television. Based on the evidence I have, specifically the Blackout Record, there's a clear contradiction since electricity to Ms. Stone's building was out from noon to 6PM on the day of the crime, which means no television could have been working at 1:00 PM. However, I don't see the specific statement about the television in the current screen. I need to press the current statement to either get more information or advance to the next statement where he mentions the television. Once I reach the statement about hearing the time from the television, I'll use court_record to open the evidence window, navigate to the Blackout Record, and present it to expose the contradiction. For now, I'll press to get more details or move forward in the testimony.",
            "game_state: Conversation\nmove: enter\nthought: I'm in Conversation mode according to the current game state, so I should use confirm to continue the dialogue. I've just said \"I've got this one\" in response to Mia's encouragement, indicating I'm ready to begin the cross-examination of Sahwit's new testimony. I've identified a critical contradiction in his testimony - he claims he heard the time from a television at 1:00 PM, but according to the Blackout Record in our evidence, electricity to Ms. Stone's building was out from noon to 6PM on the day of the crime, meaning no television could have been working at that time. By confirming now, I'll advance the dialogue and likely transition into cross-examination mode where I can expose this contradiction. Once in cross-examination mode, I'll need to carefully listen to each statement and present the Blackout Record when Sahwit mentions hearing the time from the television. This contradiction could be the key to revealing Sahwit as the true culprit and proving Larry's innocence."
        ]
    }
}