{
    "Turnabout_Sisters_part3": {
      "Case_Transcript": [
        "White: Miss May's testimony was correct... as was mine!",
        "White: When you assaulted the girl, she first ran to the left.",
        "White: And then you hit her, savagely! That is what I saw.",
        "White: Next, with the last of her strength, she ran to the right.",
        "White: You chased her, and delivered the final blow.",
        "Phoenix: I present the Mia's Autopsy Report.",
        "Phoenix: Mr. White!",
        "Phoenix: The victim died from a single blow!",
        "White: ...!",
        "Phoenix: What do you have to say to that?",
        "White: Er... Erp!",
        "Phoenix: (Now's my chance to hit him where it counts!)",
        "Phoenix: Mr. White. Wasn't it you who told this court you were \"abso-posi-lutely perfect\"?",
        "White: Mmph.",
        "White: I will refrain from using this phrase from now on.",
        "Phoenix: Your Honor, if you could ask the witness for a new testimony...",
        "Edgeworth: The witness is obviously confused, Your Honor!",
        "Edgeworth: I would like to request a 10 minute break!",
        "Judge: Yes... yes, quite.",
        "Phoenix: The witness is confused because he's lying!",
        "Phoenix: I emphatically request that there be no break, Your Honor!",
        "Judge: If the witness would care to revise his testimony...",
        "Phoenix: (The crowd's on my side! No slipping out of this now, White!)",
        "Judge: Mr. White?",
        "White: O... okay...",
        "White: Umm, well, see--I looked at the other window when I heard that thing fall.",
        "White: Then, the next moment, I saw Miss Mia run to the left!",
        "White: The killer, you, attacked her... but she dodged.",
        "White: Umm... and then...",
        "White: She turned, and ran for the door!",
        "White: Then you did her in with a single blow! Thwap!",
        "Judge: Hmm. \"Thwap\" indeed. Very well, you may begin the cross-examination.",
        "White: Mr. Your Honor... My stomach, you see, it is hurting...",
        "Phoenix: Deal with it. This is almost over.",
        "White: ...!",
        "White: Umm, well, see--I looked at the other window when I heard that thing fall.",
        "Phoenix: You heard \"that thing fall\"? What exactly was \"that thing\"?",
        "White: Huh? Oh... oh, that? Umm... the glass light stand!",
        "Phoenix: (Right... the one that had fallen over at the scene.)",
        "Maya: Phoenix!",
        "Maya: Doesn't something about that strike you as odd?",
        "Phoenix: (Yeah, that is odd. I'll press further.)",
        "Phoenix: Mr. White.",
        "White: Huh? W-what?",
        "Phoenix: You're saying you saw the glass light stand?",
        "White: Y-yes.",
        "Phoenix: Then change your testimony to reflect that!",
        "White: S-sorry. My bad...",
        "Judge: The witness will revise his testimony.",
        "White: A light stand was lying on the floor when I looked.",
        "Phoenix: I present the Glass Shards."
      ],
      "evidences": [
        "ATTORNEY'S BADGE: No one would believe I was a defense attorney if I didn't carry this.. UI description: ** The evidence is a small, round, metallic object, likely made of gold or brass. It has a distinct, thick, ridged or fluted border that surrounds a central, raised emblem. This central emblem clearly depicts the balanced scales of justice symbol. The object has a polished, shiny appearance, with shading indicating its three-dimensional, disc-like shape.",
        "MIA'S AUTOPSY REPORT: Died from a blow by a blunt object. May have lived for a few minutes after being hit.. UI description: A standard-sized, light brown manila envelope is shown. It is sealed using a traditional string-and-button closure; two dark, circular buttons are visible on the flap and body, with a light-colored string wrapped around them. The envelope appears flat, likely containing papers, and shows no visible markings or damage.",
        "MAYA'S CELL PHONE: Holds a conversation between the Chief and Maya. (September 5, 9:27 AM. Maya: Mia! What's up? You haven't called in a while. Mia: Well, actually there's something I want you to hold on to for me. Maya: Again? What is it this time? Mia: It's... a clock. It's made to look like that statue, 'The Thinker.' And it tells you the time! Ah... I should probably tell you, the clock isn't talking right now. Maya: Huh? It's not working? That's lame! Mia: I had to take the clockwork out, sorry. I put some papers inside it instead. Maya: Papers? Is that the evidence, then? Mia: I'll leave that one up to your imagination. See you tonight at nine.). UI description: The evidence is a purple flip-style cell phone, shown in its open state. It features a dark grey screen and a silver keypad with numerous small buttons. A short antenna protrudes from the top right. Attached to the top left corner is a matching purple strap or lanyard. The phone appears to be made of plastic and shows no obvious damage.",
        "GLASS SHARDS: The broken remains of a glass light stand. Broken beyond all recognition.. UI description: The evidence icon displays several irregularly shaped, white fragments scattered against a plain grey background. The pieces vary in size, with some larger flat shards and smaller slivers. They have sharp, clearly broken edges. Highlights and subtle shading give them a slightly reflective appearance, consistent with broken glass.",
        "THE THINKER: The murder weapon. Looks like a statue, but it's actually a clock. Made by Larry Butz.. UI description: A small, metallic, bronze-colored statuette of a seated male figure resting his chin on his right hand, with his right elbow on his left knee. The figure sits atop an uneven surface, mimicking a rock. This entire sculpture is mounted on a plain, white, rectangular pedestal. On the front face of the white pedestal, there is a small, dark, horizontal rectangular indentation or slot.",
        "WIRETAP: Found in Miss May's hotel room.. UI description: The evidence displayed is a small, black, rectangular plastic-looking box. Extending from one side are two flexible black wires that loop back towards the box. Each wire ends with a small, distinct, gold-colored metallic tip or contact point. The main body of the box appears solid and smooth.",
        "RECEIPT: A department store receipt with letters written in blood on the back.. UI description: A small, roughly rectangular piece of white paper, appearing slightly crumpled or folded. On its surface, the name \"Maya\" is written in large, somewhat uneven letters using a thick, red substance that resembles blood. An exclamation mark follows the name, also rendered in the same red substance. The writing style looks somewhat rushed or erratic, and the red substance appears slightly smeared or absorbed into the paper. The edges of the paper are not perfectly straight.",
        "MAY TESTIMONY: \"The victim dodged an attack then ran to the right, but she was caught and struck.\". UI description: The evidence item is a long, narrow, rectangular object, primarily white in color. It appears to be made of paper and is folded lengthwise down the center. One end looks slightly thicker, as if another piece of paper is tucked inside or it's folded over multiple times. There are no visible markings, text, or damage on its surface.",
        "FLOOR PLANS: The murder scene, the Fey & Co. Law Offices. (The room is viewed from above, split into a lit center and darker corners. A door is at the top-right, and a large window is along the top wall, casting a cone-shaped beam of light inward. In the bottom-left, a plant has been knocked over near a fallen object, with debris scattered into the light. Two pieces of furniture (likely chairs) are overturned in the middle of the room. From the window’s perspective, only the right half of the room is clearly visible—especially the plant debris and doorway area. The far-left corner (where the struggle likely began) is obscured from view, suggesting a witness outside the window could misjudge the victim’s movements.)"
      ],
      "prev_responses": [
        "game_state: Cross-Examination\nmove: z\nthought: “Yeah, very odd” is already highlighted, so I’ll confirm that choice and see what Maya has to say next.",
        "game_state: Conversation\nmove: z\nthought: continue conversation",
        "game_state: Conversation\nmove: z\nthought: continue conversation",
        "game_state: Conversation\nmove: z\nthought: continue conversation",
        "game_state: Conversation\nmove: z\nthought: continue conversation",
        "game_state: Conversation\nmove: z\nthought: continue conversation",
        "game_state: Conversation\nmove: z\nthought: continue conversation",
        "game_state: Conversation\nmove: z\nthought: continue conversation",
        "game_state: Cross-Examination\nmove: r\nthought: The witness claims he saw a light stand “lying on the floor” in one piece, yet the Court Record shows it was smashed to pieces. I’ll open the evidence window.",
        "game_state: Cross-Examination\nmove: r\nthought: White claims he saw the light stand “lying on the floor,” but the record says it was shattered. I’ll open the evidence window.",
        "game_state: Cross-Examination\nmove: right\nthought: The badge is currently selected, but I need to get to the broken glass stand evidence. I'll move right.",
        "game_state: Cross-Examination\nmove: right\nthought: The evidence window is already open, and Mia’s Autopsy Report is highlighted. I need to navigate to the Glass Shards.",
        "game_state: Cross-Examination\nmove: right\nthought: The evidence window is open and \"Maya's Cell Phone\" is selected, but I need to navigate to \"Glass Shards.\"",
        "game_state: Cross-Examination\nmove: x\nthought: Glass Shards are already highlighted, and this clearly contradicts White’s claim of seeing an intact light stand on the floor. I’ll present them now."
      ]
    }
  }