{
    "Turnabout_Sisters": {
        "Case_Transcript": [
            "Gumshoe: After securing the suspect, I examined the scene of the crime with my own eyes.",
            "Phoenix: And did you find any evidence?",
            "Gumshoe: Now, now, don't jump the gun on me, pal.",
            "Gumshoe: Just listen. I'm getting to the good part!",
            "Phoenix: (I got a bad feeling about this...)",
            "Gumshoe: I found a memo written on a piece of paper next to the victim's body!",
            "Phoenix: Just because you found it next to the body doesn't mean the victim wrote it!",
            "Gumshoe: Ho hoh! Then who did write it, smarty-pants?",
            "Phoenix: Wh-who? Um...",
            "Phoenix: Th-the killer! Anyone can see that!",
            "Gumshoe: Hoh.",
            "Gumshoe: You're saying the killer wrote her OWN name!? Buddy, please!",
            "Phoenix: She was framed!",
            "Edgeworth: Hold on.",
            "Edgeworth: If that's the case, where's your evidence?",
            "Phoenix: Ah... (Urk!)",
            "Edgeworth: Hah! I guess that was a bit of a tall order for you.",
            "Edgeworth: Those without evidence shouldn't open their mouths, Mr. Wright.",
            "Gumshoe: Yeah, pal!",
            "Phoenix: (Argh...!)",
            "Edgeworth: Well, Detective? Tell us what was written on that memo you found.",
            "Gumshoe: On it, the word \"Maya\" was written clearly in blood!",
            "Phoenix: Do you have proof it was Mia who wrote that!?",
            "Gumshoe: Of course I do, pal!",
            "Phoenix: (Uh oh... he sounded pretty confident. This might not be good...)",
            "Gumshoe: Lab test results showed that the blood was the victim's!",
            "Phoenix: What kind of \"tests\" were these again?",
            "Gumshoe: Huh? What kind? Umm... well...",
            "Gumshoe: I hear they take the, um, little bits in the blood, the... er... hemo... hemogl...",
            "Gumshoe: Hermo... goblins... hobgob... Er...? Herma-goblin bobbin...",
            "Gumshoe: I-I refuse to testify on this matter, pal!",
            "Gumshoe: I'm no expert on blood tests!",
            "Judge: Yes, that was quite clear. You may continue with your testimony.",
            "Gumshoe: Th-thanks, pal. I mean Your Honor Sir.",
            "Edgeworth: Detective Gumshoe.",
            "Gumshoe: Y-yeah?",
            "Edgeworth: I look forward to your next evaluation. As should you.",
            "Gumshoe: ...O-oh...",
            "Phoenix: (That was a mess...)",
            "Gumshoe: Right! Where was I?",
            "Gumshoe: Also, there was blood found on the victim's finger!",
            "Phoenix: Detective Gumshoe!",
            "Phoenix: There's one thing I want you to clarify for me here.",
            "Phoenix: You say that the victim, Mia Fey, wrote this note.",
            "Phoenix: That she was accusing the defendant, Maya Fey?",
            "Phoenix: That's really what you're saying?",
            "Gumshoe: Wh-what? This isn't one of those lawyer tricks, now, is it?",
            "Gumshoe: Of course she wrote it! Who else could have!?",
            "Phoenix: You have it backwards, Detective.",
            "Gumshoe: B-backwards?",
            "Phoenix: The victim is the only person who absolutely could NOT have written it!",
            "Phoenix: This is a report from your department, Detective.",
            "Phoenix: \"Immediate death due to a blow from a blunt object.\"",
            "Phoenix: She died immediately!",
            "Gumshoe: But...!",
            "Phoenix: No \"but\"-ing your way out of this one, Detective!",
            "Judge: Order! Order!",
            "Judge: The defense has a point.",
            "Judge: Someone who died immediately wouldn't have had the time to write anything down.",
            "Edgeworth: Mr. Wright.",
            "Edgeworth: I beg your pardon, but when exactly did you obtain that autopsy report?",
            "Phoenix: Wh-when...!?",
            "Phoenix: It was the day after the murder...",
            "Judge: The prosecution's point being...?",
            "Edgeworth: That autopsy report is outdat",
            "Phoenix: Wh-what!?",
            "Edgeworth: A second autopsy was performed yesterday, at my request!",
            "Edgeworth: \"Death was almost immediate due to a blow from a blunt object...\"",
            "Edgeworth: \"But there is a possibility the victim lived for several minutes after the blow.\"",
            "Edgeworth: I received these results this morning.",
            "Phoenix: N-no way!",
            "Edgeworth: Your Honor!",
            "Edgeworth: It's quite easy to imagine that the victim did have time to write \"Maya\"!",
            "Edgeworth: That is all.",
            "Judge: I see!",
            "Phoenix: (Damn you, Edgeworth!)",
            "Phoenix: (I should have known you'd have something up your sleeve!)",
            "Edgeworth: Why, Mr. Wright, you look shocked!",
            "Edgeworth: Something you want to say?",
            "Phoenix: Mr. Edgeworth...",
            "Phoenix: I've heard there's nothing you won't do to get your verdict...",
            "Phoenix: What reason could you possibly have had to request a second autopsy report?",
            "Judge: Mr. Wright! The defense will refrain from personal attacks on the prosecution!",
            "Edgeworth: No matter, Your Honor...",
            "Edgeworth: Say what you will, the evidence in this report is undeniable.",
            "Edgeworth: Your Honor, I submit this report to the court.",
            "Judge: U-understood. The court accepts the evidence.",
            "Narrator: Autopsy Report updated in the Court Record.",
            "Edgeworth: Well, Your Honor?",
            "Edgeworth: The evidence strongly suggests the victim was identifying the killer.",
            "Judge: I suppose that's the obvious conclusion, yes.",
            "Phoenix: (Darn! This isn't good!)",
            "Edgeworth: The prosecution would like to call its next witness.",
            "Edgeworth: This poor, innocent girl saw the murder with her own eyes!",
            "Judge: Let the witness Miss April May take the",
            "Phoenix: (Exactly what part of her is \"innocent\"...?)",
            "Edgeworth: Witness, your name, please.",
            "April: April May! / At your service! *wink*",
            "Judge: Order!",
            "Judge: The witness will refrain from wanton winking!",
            "April: Aww... Yes, Your Honor.",
            "Phoenix: (This is not good...)",
            "Phoenix: (She's already captured the heart of every man in this courtroom!)",
            "Edgeworth: Tell us, where were you on the night of September 5, when the murder occurred?",
            "April: Um... gee... I was, like, in my hotel room? Tee hee.",
            "April: I checked in right after lunch.",
            "Edgeworth: And this hotel is directly across from the Fey & Co. Law Offices?",
            "April: Mmm... that's right, big boy.",
            "Judge: Please testify to the court about what you saw.",
            "SYSTEM: -- Witness's Account --",
            "April: It was, like, 9:00 at night. I looked out the window, y'know!",
            "April: And then, oooh! I saw a woman with long hair being attacked!",
            "April: The one attacking her was the mousey girl sitting in the defendant's chair!",
            "April: Then the woman, like, dodged to one side and ran away!",
            "April: But that girl, she caught up to her and... and... She hit her!",
            "April: Then the woman with the long hair...",
            "April: She kinda... slumped.",
            "April: The end. That's all I saw. Every little bitsy witsy!",
            "Judge: Hmm...",
            "Judge: I see. It is a remarkably solid testimony.",
            "Judge: I don't see a need to trouble the witness any...",
            "Phoenix: W-wait, Your Honor!",
            "Judge: Yes, Mr. Wright?",
            "Phoenix: What about my cross-examination!?",
            "Judge: I thought the witness's testimony just now was quite... firm. Didn't you?",
            "Edgeworth: Mr. Wright... I understand you were Ms. Mia Fey's understudy, were you not?",
            "Edgeworth: You must know her techniques well.",
            "Edgeworth: Her cowardly way of finding tiny faults in perfectly good testimonies...",
            "Phoenix: H-hey! How dare you!",
            "Judge: Well, Mr. Wright? Will you cross-examine the witness?",
            "Phoenix: I'll gladly proceed with the cross-examination.",
            "Phoenix: (If only because I have a feeling Edgeworth doesn't want me to!)",
            "Phoenix: (She has to have some weakness!)",
            "Judge: Very well, you may begin your cross-examination!",
            "NONE: -- Witness's Account --",
            "Phoenix: Why did you do that?",
            "April: Huh? \"Why\"? Like, why what?",
            "Phoenix: Why did you look out the window? Were you expecting to see something?",
            "April: Oh, well, um... gee!",
            "Phoenix: (What? That's it? She can't get out of this question that easily!)",
            "April: I sort of, y'know.",
            "April: I had a feeling!",
            "Phoenix: (We",
            "Phoenix: (Maybe I should press a little harder on this one?)",
            "Phoenix: (Let's see how far I can run with this...)",
            "Phoenix: Surely, you must have had a reason to look out your window at that time of night!",
            "April: I... oooh!",
            "Edgeworth: Mr. Wright! I will not have you badgering my witness!",
            "Phoenix: B-badgering?",
            "Edgeworth: You insist on needling her with these trivial questions.",
            "Edgeworth: I really don't think it should be allowed.",
            "???: (The poor girl!)",
            "Judge: Mr. Wright, you have been warned.",
            "Phoenix: (Poor girl!? What about poor me!?)",
            "Edgeworth: You looked out the window.\\nWhat did you see next?",
            "Phoenix: How did you know it was my client!?",
            "April: Huh? Well, I... gee!",
            "April: First of all, she had a girl's physique!",
            "April: And, and secondly, she was... she was small!",
            "April: Who else could it be but her!",
            "Phoenix: (She has a point...)",
            "Phoenix: Hold on a minute! That testimony stinks!",
            "April: W-what!?",
            "Phoenix: Miss May, I'm willing to bet that...",
            "Phoenix: Did you really see the defendant at all!?",
            "Judge: Mr. Wright! What's the meaning of this?",
            "April: Yes, what is the meaning! Somebody tell me because I'm clueless! About this, I mean!",
            "Phoenix: Okay...",
            "Phoenix: If you had really witnessed my client, Maya Fey...",
            "Phoenix: You would have noticed her clothes before noticing her physique!",
            "April: ...!",
            "Phoenix: No one wears clothes like this on a daily basis! Except her!",
            "Phoenix: And I'm no expert on fashion, but her hairdo looks far from normal to me!",
            "Phoenix: However, the witness's testimony mentions neither of these things!",
            "Phoenix: The testimony is bogus!",
            "April: But... but!",
            "Judge: Still, we don't know if she was dressed that way the night of the murder...",
            "Phoenix: She was, Your Honor!",
            "Phoenix: I saw her.",
            "Phoenix: And so did Detective Gumshoe!",
            "Phoenix: What do you say to that, Miss May?",
            "April: Rowr! What are you trying to say, you mean lawyer!",
            "April: I-I saw what I saw.",
            "April: I... just didn't think all the trifling little details were necessary, darling.",
            "Judge: Miss May.",
            "Judge: The court would like to remind you to please omit nothing in your testimony.",
            "April: I'm sorry, Your Honor. / I'll be a good girl. / I promise. \\*wink\\*",
            "Judge: Your testimony again, if you would.",
            "Phoenix: (Damn, I almost had her!)",
            "NAME: -- Witness's Account --",
            "April: I did see everything! I did!",
            "April: The victim--the woman--dodged the first attack and ran off to the right.",
            "April: Then the girl in the hippie clothes ran after her...",
            "April: And she hit her with that weapon! I saw it! I did!",
            "April: That... that clock! Um... the kinda statue-y clock? \"The Thinker,\" I think?",
            "April: Well? Does the accuracy of my report not startle you? Tee hee!",
            "Judge: I... see.",
            "Judge: I only wish you had been so detailed from the beginning.",
            "Judge: Please begin the cross-examination.",
            "April: I did see everything! I did!",
            "April: The victim--the woman--dodged the first attack and ran off to the right.",
            "April: Then the girl in the hippie clothes ran after her...",
            "April: And she hit her with that weapon! I saw it! I did!",
            "Phoenix: I present the The Thinker.",
            "Phoenix: Miss May.",
            "April: Revealing? Oooh, you'd like that, wouldn't you. Naughty Mr. Lawyer...",
            "Phoenix: But there's no way of knowing that just by looking at it!",
            "April: Urp!",
            "Phoenix: Another person in much the same position as you recently called this a \"clock,\" too...",
            "Phoenix: Miss May. Can you explain how you know this was a clock?",
            "April: Oooh... urp!",
            "Edgeworth: The witness saw the murder with her own eyes! That's all that's importan",
            "Edgeworth: The defense is trying to confuse the issue with trivial concerns!",
            "Judge: Yes... yes, of course. You will withdraw your question, Mr. Wright.",
            "Phoenix: But questions are all I have, Your Honor!",
            "Phoenix: And as you may recall, I've caught murderers with these questions before!",
            "Phoenix: (Well, only once...)",
            "Judge: ...",
            "Judge: Objection sustained. You may continue to question the witness.",
            "Phoenix: (Whew, that was close.)",
            "Phoenix: (If he stopped me there, the trial would be over!)",
            "April: Huh? What? So... what happens now?",
            "Phoenix: What happens now is you answer my question! How did you know it was a clock?",
            "April: What...! Th-that's...",
            "April: ...Because... I heard it?",
            "April: Yes! I heard it say the time!",
            "Phoenix: So, you've been to the law offices of Fey & Co.!",
            "April: N-n-no! Hey, I didn't say that! Why would I go there!",
            "Edgeworth: She could easily have heard the clock!",
            "Phoenix: (I can't give up now!)",
            "Phoenix: I'm not satisfied because...",
            "Phoenix: Your Honor, members of the court...",
            "Phoenix: It is inconceivable that the clock in question rang!",
            "Phoenix: That clock is missing its clockwork!",
            "Judge: H-how co",
            "Phoenix: Just take a look... Right now!",
            "Judge: Oh!",
            "Phoenix: See anything interesting, Your Honor?",
            "Judge: It is as the defense says!",
            "Judge: This clock is missing its clockwork!",
            "Judge: It's quite empty!",
            "Judge: Mr. Wright!",
            "Judge: Would you care to explain to the court the meaning of this?",
            "Phoenix: It is as you can see.",
            "Phoenix: Therefore, this witness...",
            "Phoenix: is a big, fat liar!",
            "Phoenix: Well, Miss May?",
            "Edgeworth: Tsk tsk.",
            "Phoenix: ?",
            "Edgeworth: Quite a show you've put on for us, Mr. Wright.",
            "Phoenix: (He knew the clock was empty! Somehow... he knew!)",
            "Edgeworth: I'm afraid you've forgotten one thing, however.",
            "Edgeworth: Indeed, the clock is empty. As you say... it can't ring.",
            "Edgeworth: However, we must ask: when was the clockwork removed?",
            "Judge: !",
            "Judge: Hmm! That's true. That is a possibility.",
            "Judge: The clock might have been emptied after she heard it.",
            "Edgeworth: And that is exactly what happened, Your Honor!",
            "Judge: Well, Mr. Wright?",
            "Judge: Can you prove when the clockwork was removed?",
            "Edgeworth: Ho hoh! Impossible, of course...",
            "Phoenix: I have proof.",
            "Edgeworth: W-what!?",
            "Phoenix: Wasn't it you who told me \"proof is everything\"?",
            "Phoenix: Well, I was listening.",
            "Phoenix: And now I'll show you the \"proof\" you like so much!",
            "Phoenix: The evidence that proves when the clockwork was removed is...",
            "Phoenix: I present the Maya's Cell Phone.",
            "Phoenix: Take a look at this!",
            "April: Ooh hoo! You have a girlie phone!",
            "Phoenix: W-wait! Wait! This isn't my phone!",
            "Phoenix: Listen!",
            "Phoenix: This is the defendant's cell phone, and it contains a recording...",
            "Phoenix: A recording of a conversation she had with the victim on the day of the murder!",
            "Edgeworth: The defendant's cell phone!? Th-this wasn't brought to my attention!",
            "Phoenix: Perhaps Detective Gumshoe overlooked it?",
            "Edgeworth: *grumble* (The good detective better remember he's up for evaluation soon...)",
            "Phoenix: (I gotta say, I'm starting to feel bad for the big fella.)",
            "Phoenix: Let's hear the conversation.",
            "Cellular: *beep*",
            "Phoenix: Your Honor,",
            "Phoenix: I think this makes it clear the clockwork was already gone by the time this was recorded,",
            "Phoenix: which was well before the witness even arrived at her hotel!",
            "April: Muh... muh... muh!?",
            "Phoenix: Just how did you know that weapon was a clock!?",
            "April: ...",
            "April: W-well...!",
            "April: I saw that clock before!",
            "April: Um... what store was that again? I-I go to so many!",
            "April: Oops! I forgot!\\n*wink*",
            "Judge: So the witness had seen it before. That would make sense.",
            "Judge: Does the defense have any objections, Mr. Wright?",
            "Phoenix: But this directly contradicts a piece of evidence already submitted to this court!",
            "Judge: Well then, let's see it.",
            "Judge: Please produce this evidence that will prove the witness had not seen the clock before.",
            "Phoenix: It's simple.",
            "Phoenix: This clock was never in any store, ever!",
            "April: W-whaaat!?",
            "Phoenix: A friend of mine made that clock.",
            "Phoenix: Only two exist in the world.",
            "Phoenix: And the one that isn't here is in police custody!",
            "April: I-impossible! Everything is sold in stores!",
            "April: Mmpf...",
            "Phoenix: Oh? Excuses not on sale today?",
            "April: Ooooorrrrr",
            "April: That stupid clock doesn't matter, okay!?",
            "April: She did it! And she should die for it! Die!",
            "Judge: W-w-w",
            "Judge: T-this is a court of law, and the witness will remain calm!",
            "April: Oh! Oh? Oh hoh ho! S-silly me! *grunt*",
            "April: Did I, um, like... lose it?",
            "Phoenix: (S-scary...)",
            "Judge: Miss May, let me ask.",
            "Judge: Tell me, how did you know the weapon was a clock?",
            "Judge: Hmm... oh dear.",
            "Judge: Does the defense have an opinion on this... behavior?",
            "Phoenix: (Okay, this is it!)",
            "Phoenix: Yes, Your Honor. Allow me to explain how I see the truth of the matter.",
            "Phoenix: Miss April May, you knew the weapon was a clock because...",
            "Phoenix: (This is familiar territory. I'll just use the same approach as with Larry.)",
            "Phoenix: Miss May held that very clock in her hands!",
            "Judge: Mr. Wright! When was this!?",
            "Phoenix: When she used it to strike the victim! When else?",
            "Judge: Mr. Wright! What is the meaning of this!?",
            "Phoenix: April May, you killed Mia Fey, I say!",
            "Phoenix: And when you struck, the force of the impact made \"The Thinker\" ring!",
            "Phoenix: That's when you heard it!",
            "Edgeworth: ...",
            "Edgeworth: You truly are a work of art, Mr. Phoenix Wright.",
            "Phoenix: W-what's that supposed to mean!?",
            "Edgeworth: It was you who just proved that \"The Thinker\" was empty!",
            "Phoenix: Oh... (Urk! Of course it wouldn't ring!)",
            "Edgeworth: What's more, the witness has a rock-solid alibi.",
            "Edgeworth: Miss May?",
            "Edgeworth: Perhaps you could explain to the poor, misguided Mr. Wright?",
            "Edgeworth: That you were in the hotel at the time of the murder.",
            "Phoenix: (S-she can't prove it! She did it!)",
            "April: It would be MY pleasure!",
            "April: Yes way, Mr. Lawyer.",
            "April: Tee hee? Didn't the murder take place at 9:00 at night?",
            "April: Gee, that's the exact time I ordered some room service from the hotel bellboy!",
            "Edgeworth: Incidentally, the bellboy corroborates the witness's story.",
            "Edgeworth: Ergo, she was not at the crime scene! Rock solid!",
            "Judge: Mr. Wright! You've just ma",
            "Phoenix: S-sorry, Your Honor. (That... didn't go so well.)",
            "Phoenix: (But, if that's the case...)",
            "Phoenix: (Then how did she know \"The Thinker\" was a clock!?)",
            "Phoenix: (...)",
            "Phoenix: (Wait!)",
            "Phoenix: Your Honor, I figured it out!",
            "Phoenix: There is one other way Miss April May could have known it was a clock!",
            "Phoenix: One way alone! And I have proof!",
            "Judge: Well... proof, you say?",
            "Judge: Then, the court will examine your proof, Mr. Wright.",
            "Judge: How did the witness know \"The Thinker\" was a clock?",
            "Phoenix: I present the Wiretap.",
            "Phoenix: Have a look at this.",
            "April: Ah! Oooh! Th-that!? Eh heh...",
            "Phoenix: I found this in Miss May's room.",
            "Phoenix: Miss April May?",
            "Phoenix: You were tapping the victim, Ms. Mia Fey's phone, were you not?",
            "Judge: I'm not entirely sure that it is. Objection overruled.",
            "Judge: It troubles me that our witness was in possession of a wiretap.",
            "Edgeworth: This is outrageous! Does the defense truly claim that the witness was tapping her phone?",
            "Phoenix: Absolutely!",
            "Edgeworth: Even if that was the case, which it's not, you still have to prove one thing!",
            "Edgeworth: Did the victim ever say that the weapon was a clock on the phone?",
            "Edgeworth: Can you prove that? I THINK NOT!",
            "Phoenix: Oh yeah? I THINK I CAN! It's simple!",
            "Edgeworth: WHAAAAT!?",
            "Phoenix: Here's my proof.",
            "Phoenix: The proof that the victim said, on the phone, that the weapon was a clock is...",
            "Phoenix: I present the defendant's cell phone.",
            "Judge: Yes, we've seen that.",
            "Maya: [Mia! What's up? You haven't called in a while.]",
            "Mia: [Well, actually there's something I want you to hold on to for me.]",
            "Maya: [Again? What's it this time?]",
            "Mia: [It's... a clock.]",
            "Mia: [It's made to look like that statue, \"The Thinker.\" And it tells you the time!]",
            "Phoenix: Miss April May!",
            "Phoenix: You used a wiretap to listen to this conversation!",
            "Phoenix: That's how you knew \"The Thinker\" was a clock!",
            "Phoenix: Am I wrong!?",
            "April: I... I...",
            "Edgeworth: Your Honor, this is ridiculous!",
            "Phoenix: Your Honor, look at the witness's face! Does she seem amused to you!?",
            "Phoenix: The defense demands an answer.",
            "April: La... laaa... lrrrrgf!",
            "Judge: Witness, answer the question. Did you tap her phone?",
            "Judge: Miss May!",
            "April: You... you LAWYER!",
            "April: Oh, so I'm the bad girl, is that it? Is that it!?",
            "Phoenix: (empty dialog - appears to be waiting for player input)",
            "Phoenix: (Now to deal the final blow!)",
            "Phoenix: Miss May, confess. You did it, didn't you?",
            "April: Are you out of your mind!? Oh wait, I forgot... you're a lawyer! You must be!",
            "April: At the time of the murder...",
            "April: I was in my hotel room, getting room service!",
            "April: How could I have killed her?",
            "April: If you don't believe me, just ask the bellboy!",
            "Judge: Well, does the defense have anything to say?",
            "Phoenix: Um, well... (Come on, think of something!)",
            "Phoenix: There's something suspicious here, and I'm going to get to the bottom of it!",
            "April: I think you've sunken quite low enough already.",
            "Edgeworth: I object to calling the bellboy!",
            "Phoenix: W-why? What's your reason?",
            "Edgeworth: Because I hold that the wiretapping had nothing to do with the killing!",
            "Phoenix: ...!",
            "Edgeworth: However...",
            "Edgeworth: If you agree to one condition, I'll consent to calling this witness.",
            "Phoenix: Condition...?",
            "EDGEWORTH: If Miss April May's alibi is not called into question after you examine the bellboy...",
            "Edgeworth: then you will recognize that Miss April May was not the killer, thus she is innocent!",
            "Edgeworth: And thereby, you must also accept the verdict of \"guilty\" for Ms. Maya Fey!",
            "Edgeworth: That is my condition.",
            "Phoenix: (What...!?)",
            "Phoenix: (I'd better find something suspicious in that bellboy's testimony...)",
            "Phoenix: (Otherwise Maya will be declared \"guilty\" on the spot!)",
            "Phoenix: (What should I do...?)",
            "Phoenix: (Alright! I've got nothing to lose! Except for... well, everything!)",
            "Phoenix: Understood. I accept your condition.",
            "Edgeworth: Hmph.",
            "Edgeworth: Fool... You fell right into my trap!",
            "Phoenix: (Uh oh!)",
            "Judge: Very well!",
            "Judge: The court calls the hotel bellboy to the stand!",
            "Edgeworth: I believ",
            "Edgeworth: He certainly does look like a bellboy.",
            "Bellboy: Yes, sir.",
            "Bellboy: I received your summons in the middle of work, sir. I'm happy to be of service.",
            "Judge: That tea set looks rather heavy, so without further ado,",
            "Judge: the witness may begin his testimony.",
            "Bellboy: Very good, sir!",
            "Bellboy: I am the head bellboy at the fine Gatewater Hotel, in business for four generations!",
            "Bellboy: I believe I received a call after 8:00 in the evening from our guest, Miss May.",
            "Bellboy: She asked for an ice coffee to be brought to her at 9:00, on the dot, sir.",
            "Bellboy: I brought it to her at precisely the requested time, of course.",
            "Bellboy: And I delivered the ice coffee to our guest Miss May, herself.",
            "Judge: I see. The defense may begin its cross-examinati",
            "Phoenix: R-right! I'm ready. (I hope...)",
            "Phoenix: (This is it...)",
            "Phoenix: (If I can't prove Miss May was involved with the murder now...)",
            "Phoenix: (Maya will be finished!)",
            "Bellboy: I am the head bellboy at the fine Gatewater Hotel, in business for four generations!",
            "Bellboy: I believe I received a call after 8:00 in the evening from our guest, Miss May.",
            "Bellboy: She asked for an ice coffee to be brought to her at 9:00, on the dot, sir.",
            "Bellboy: And I delivered the ice coffee to our guest Miss May, herself.",
            "Phoenix: You are sure it was Miss April May herself?",
            "Bellboy: Ab-SO-lutely, sir.",
            "Phoenix: \"Ab-SO-lutely\"...?",
            "Bellboy: Yes, sir. As in, \"so very absolutely,\" sir. It's an endearing mannerism of mine.",
            "Phoenix: How come you're so very certain!?",
            "Bellboy: Well, when I brought the room service, sir...",
            "Bellboy: S-she... the guest, sir, favored me w-with a, um, an \"embrasser,\" sir.",
            "Phoenix: \"Embrasser\"!? Is that French for \"embrace\"?",
            "Bellboy: It's French for \"kiss,\" sir. But not a French kiss, sir! More of a peck on the c",
            "Phoenix: Wh-why would she have done that...?",
            "Bellboy: I believe, perhaps, she was momentarily swayed by my prim demeanor, sir.",
            "Bellboy: It was a moment I shall never, ever forget, sir.",
            "Phoenix: (Sounds pretty fishy to me...)",
            "Phoenix: (I think our Miss May was up to something and wanted the bellboy to remember her!)",
            "Phoenix: (This bellboy wouldn't have any reason to lie...)",
            "Phoenix: (But I have to find something to use in his testimony!)",
            "Phoenix: (One more time. I'll press him until he spills the beans... or his tea!)",
            "Bellboy: I am the head bellboy at the fine Gatewater Hotel, in business for four generations!",
            "Bellboy: I believe I received a call after 8:00 in the evening from our guest, Miss May.",
            "Bellboy: She asked for an ice coffee to be brought to her at 9:00, on the dot, sir.",
            "Bellboy: I brought it to her at precisely the requested time, of course.",
            "Phoenix: \"Precisely\" 9:00, then?",
            "Bellboy: Precisely, exactly, and most definitely, sir. 9:00 PM.",
            "Phoenix: How can you be so sure!?",
            "Bellboy: Miss May was quite insistent that it be brought then.",
            "Bellboy: \"Oh, bellboy? Tee hee! I'd like, like, ice coffee at exactly 9:00!\"",
            "Bellboy: Something like that, sir.",
            "Bellboy: Therefore, I knocked on her door at the crack of 9:00, sir.",
            "Phoenix: (Why would she be so particular about the time?)",
            "Phoenix: ...",
            "Phoenix: It's no good! (There's nothing there!)",
            "Phoenix: (Is... is that it!?)",
            "Edgeworth: Finally, you understand.",
            "EDGEWORTH: This bellboy has absolutely no reason to lie!",
            "Edgeworth: Now...",
            "Edgeworth: If you have any decency, you will end this rather tedious cross-examination here!",
            "Judge: Hmm. It was a bit tedious.",
            "Judge: The witness may leave the stand.",
            "Phoenix: (I can't let this happen... can I?)",
            "Phoenix: W-wait! Please wait!",
            "Judge: Yes? Does the defense have something to add?",
            "Phoenix: One last question... let me ask one last question!",
            "Edgeworth: Your Honor, I must object.",
            "Edgeworth: This charade of justice has gone on long enough!",
            "Judge: Now, now, Mr. Edgeworth.",
            "Judge: Alright Mr. Wright. I'll give you one more question, that's all.",
            "Phoenix: (Okay.)",
            "Phoenix: (This is really it, now. This is my last chance!)",
            "Phoenix: (What do I ask him about...!?)",
            "Phoenix: T-tell me again about er... room service!",
            "Bellboy: A-again, sir?",
            "Bellboy: At exactly 9:00, I delivered room service to Miss May in room 303.",
            "Bellboy: The guest had requested ice coffee... $18 was the charge, as I recall.",
            "Phoenix: I see...",
            "Phoenix: ...?",
            "Phoenix: E-eighteen dollars? Doesn't that seem a bit expensive?",
            "Bellboy: Y-yes, well, ice coffee for two, you know. And we don't skimp on the ice,",
            "Phoenix: (...!)",
            "Phoenix: (What did he say!?)",
            "Phoenix: What did you say!?",
            "Bellboy: Ah! Oh... er... rather, quite!",
            "Phoenix: Bellboy! Tell us the truth now...",
            "Phoenix: Was someone else staying in Miss May's room?",
            "Edgeworth: I object! That was... objectionable!",
            "Judge: Objection overruled. The witness will answer the question.",
            "Bellboy: Er... yes, I see.",
            "Phoenix: Why did you not mention this in your testimony!?",
            "Bellboy: W-well, sir, you er... you didn't ask!",
            "Phoenix: (Nice try!)",
            "Phoenix: That's the sort of thing you're normally supposed to mention!",
            "Bellboy: Ah, yes, quite. Indeed...",
            "Bellboy: It was the, er, good barrister there, Mr. Edgeworth, who...",
            "Phoenix: !",
            "Bellboy: He asked me not to mention it if I wasn't specifically asked, sir.",
            "Edgeworth: Oof!",
            "Edgeworth: Y-you fool!",
            "Phoenix: I've done it... I've won!",
            "Phoenix: Miss April May checked into a twin room...",
            "Phoenix: Correct?",
            "Phoenix: Then, when you brought them room service,",
            "Phoenix: you didn't see that man in the room...?",
            "Bellboy: That's right, sir.",
            "Phoenix: Your Honor!",
            "Phoenix: We have just learned of another person involved who may have been the murderer!",
            "Phoenix: In light of this new fact, I hold that it's impossible to judge the defendant.",
            "Phoenix: Wouldn't you agree, Mr. Edgeworth?",
            "Edgeworth: And who, Mr. Wright! Who is this \"other person\"!",
            "Phoenix: Simple, it was...",
            "Phoenix: The man who checked in with Miss May!",
            "Phoenix: As has been previously revealed, Miss April May was tapping the victim's phone.",
            "Phoenix: Yet Miss May herself has an alibi at the time of the murder.",
            "Phoenix: However, that does not clear the man that was with her!",
            "Phoenix: The bellboy saw no one else in the room at the time of the murder!!!",
            "Edgeworth: M-my, what a convenient little setup... but it's too late...",
            "Phoenix: \"Too late\"?",
            "Phoenix: I suppose you'd like it if it was too late, wouldn't you...",
            "Phoenix: After all, it was you who hid the presence of the other man from this court!",
            "Edgeworth: Upstart... amateur...!",
            "Edgeworth: T-these accusations are... ludicrous!",
            "Judge: Enough!",
            "Judge: The court acknowledges the defense's argument.",
            "Judge: I expect the prosecution and defense to look into this matter fully!",
            "Judge: Am I understood?",
            "EDGEWORTH: Yes... *gasp* Yes, Your Honor.",
            "Judge: That is all today for the trial of Maya Fey.",
            "Judge: Court is adjourned!",
            "Maya: Mr. Wright!",
            "Maya: You were amazing in there!",
            "Phoenix: R-really?",
            "Maya: I think I might be your newest fan!",
            "Phoenix: Oh, I was just \"doing my job\" you know... heh heh.",
            "Maya: Then again, that other attorney was pretty cool, too...",
            "Phoenix: Huh?",
            "Maya: That face of his! With his eyes wide, and trembling lips!",
            "Maya: It sent shivers up my spine!",
            "Phoenix: Hmm... if you say so.",
            "Maya: So, what happens with me?",
            "Maya: Do I get to go home now?",
            "Phoenix: Um, well...",
            "Phoenix: No, I don't think so. Not yet.",
            "Maya: Oh... I see.",
            "Phoenix: But I got a great lead in today's trial!",
            "Maya: A \"lead\"?",
            "Phoenix: That man with Miss May! He's the key!",
            "Maya: Oh! I get it.",
            "Maya: What happened to Miss May after that, anyway?",
            "Phoenix: I heard they arrested her. I guess she's learning her charms won't work everywhere.",
            "Phoenix: She's probably at the detention center now. I may have to go down there later.",
            "Phoenix: Anyway.",
            "Phoenix: This case is far from closed.",
            "Maya: Yes sir!",
            "Phoenix: I'm going to find out more about this man.",
            "Maya: Do you think he was the one who...?",
            "Phoenix: Maybe so.",
            "Maya: Sis...",
            "Phoenix: Don't worry, I'll find him by tomorrow. I promise.",
            "Maya: I'm counting on you!",
            "Phoenix: I asked for a full record of April May's testimony.",
            "Phoenix: I thought it might come in handy during the trial tomorrow.",
            "Phoenix: But now that I have it, I'm not so sure.",
            "Phoenix: Most of her testimony was all lies...",
            "Phoenix: In fact, there's only one part that hasn't been stricken from the record.",
            "System: May Testimony added to the Court Record.",
            "Phoenix: I don't know how much good this will do me at all, now.",
            "Phoenix: Anyway, time to hit the pavement and do some investigating!",
            "Phoenix: Maya doesn't belong in that detention center, and it's up to me to set her free!"
        ],
        "evidences": [
            "ATTORNEY'S BADGE: No one would believe I was a defense attorney if I didn't carry this.. UI description: The evidence is a circular, metallic gold badge or pin. It has a thick appearance with a prominently ridged or fluted outer edge, giving it a textured border. The central area features an embossed symbol, though its precise details are somewhat obscured by the lighting and angle; it seems complex, possibly depicting scales or stylized characters. The surface has a polished, metallic sheen and appears to be in good condition, without any visible scratches or damage.",
            "MIA'S AUTOPSY REPORT: Time of death: 9/5 at 9:00 PM. Cause: single blunt force trauma. Death was instantaneous.. UI description: The evidence displayed is a standard, tan-colored manila envelope. It is rectangular and appears to be made of paper. On the side shown, there are two dark, circular buttons part of a string-and-button closure mechanism, indicating this is likely the back of the envelope. The string itself is wrapped around the buttons, suggesting the envelope is sealed. There is no visible writing, address, or other markings on the envelope itself.",
            "MAYA'S CELL PHONE: Holds a conversation between the Chief and Maya. (September 5, 9:27 AM. Maya: Mia! What's up? You haven't called in a while. Mia: Well, actually there's something I want you to hold on to for me. Maya: Again? What is it this time? Mia: It's... a clock. It's made to look like that statue, 'The Thinker.' And it tells you the time! Ah... I should probably tell you, the clock isn't talking right now. Maya: Huh? It's not working? That's lame! Mia: I had to take the clockwork out, sorry. I put some papers inside it instead. Maya: Papers? Is that the evidence, then? Mia: I'll leave that one up to your imagination. See you tonight at nine.). UI description: The evidence is a somewhat dated, candy bar-style cell phone. Its main casing is a vibrant metallic purple or pink color. Below the dark, rectangular screen is a silver keypad with multiple small, rectangular buttons arranged in a grid. A short, stubby antenna extends from the top right corner. Attached to the top left corner is a thick, dark purple fabric wrist strap. The phone appears intact and functional, without obvious signs of damage.",
            "GLASS SHARDS: The broken remains of a glass light stand. Broken beyond all recognition.. UI description: The evidence icon displays approximately six irregularly shaped, sharp-edged fragments. The pieces vary in size and have a light grey/white, somewhat reflective appearance, suggesting broken glass. Some fragments possess a slight curvature. They are depicted scattered across a grey background within the evidence slot.",
            "THE THINKER: The murder weapon. Looks like a statue, but it's actually a clock. Made by Larry Butz.. UI description: The evidence is a small, metallic statue resembling Rodin's \"The Thinker.\" The figure is depicted in a seated, thinking pose, colored in a bronze or brass tone. It is mounted on a square, metallic grey base. The front of the base features a small, dark, rectangular slot or recessed area. The statue appears intact and relatively small, suitable for placement on a desk or table.",
            "WIRETAP: Found in Miss May's hotel room.. UI description: The item consists of a small, black, rectangular plastic box. Two flexible black wires emerge from one end of the box, loop around, and terminate in small, cylindrical, gold-colored metallic tips. The overall object appears to be a compact electronic device.",
            "RECEIPT: A department store receipt with letters written in blood on the back.. UI description: The evidence is a slightly crumpled, roughly rectangular piece of white paper. On its surface, the name \"Maya!\" is written in large, thick, dripping letters using a red substance that resembles blood. The handwriting is somewhat uneven.",
            "FLOOR PLANS: The murder scene, the Fey & Co. Law Offices.. UI description: The evidence is a single, slightly tilted square or rectangular piece of paper. It appears light gray or off-white and has a smooth, possibly slightly reflective surface. There are no visible markings, text, folds, or damage on the paper. It looks like a blank sheet."
        ],
        "prev_responses": [
            "game_state: Conversation\nmove: z\nthought: continue conversation",
            "game_state: Conversation\nmove: z\nthought: continue conversation",
            "game_state: Conversation\nmove: z\nthought: continue conversation",
            "game_state: Conversation\nmove: z\nthought: continue conversation",
            "game_state: Conversation\nmove: z\nthought: continue conversation",
            "game_state: Conversation\nmove: z\nthought: continue conversation",
            "game_state: Conversation\nmove: z\nthought: continue conversation",
            "game_state: Conversation\nmove: z\nthought: continue conversation",
            "game_state: Conversation\nmove: z\nthought: continue conversation",
            "game_state: Conversation\nmove: z\nthought: continue conversation",
            "game_state: Conversation\nmove: z\nthought: continue conversation",
            "game_state: Conversation\nmove: z\nthought: continue conversation",
            "game_state: Conversation\nmove: z\nthought: continue conversation",
            "game_state: Conversation\nmove: z\nthought: continue conversation"
        ]
    }
}