{
    "Turnabout_Sisters_2": {
        "Case_Transcript": [
            "White: Let's see, it was about 9:00, I believe.",
            "White: I was quietly perusifying... er, that's \"reading\" to you, some papers by the window.",
            "White: Then I heard a bedlam coming from outside!",
            "White: Surprised, I turned to look at the building across the way.",
            "White: It was then I saw him: a spiky-haired man attacking a woman with long hair!",
            "White: Needless to say that man was none other than you, Mr. Lawyer!",
            "White: I called Miss May over at once. She, too, was surprised of course.",
            "White: The victim, she... she ran away, but you gave chase!",
            "Phoenix: Can you be a little more detailed about that?",
            "Phoenix: I think it's worth knowing exactly what happened.",
            "White: Of course! Comprende! I understand!",
            "White: The victim was attacked, by you, and ran to the left.",
            "White: You gave chase, and struck her down!",
            "Edgeworth: Are you sure?",
            "White: As you know, I am always abso-posi-lutely",
            "Judge: Perhaps you could change your testimony to reflect this new detail.",
            "White: The victim ran to the left, and you gave chase!",
            "Phoenix: I present the May Testimony.",
            "Phoenix: Wait right there!",
            "Phoenix: Mr. White, you've dug your own grave!",
            "White: What is this!?",
            "Phoenix: You said the victim ran to the \"left.\"",
            "Phoenix: But that directly contradicts Miss May's testimony!",
            "Phoenix: She clearly stated that the victim ran \"right\"!",
            "White: ...!",
            "White: Oh hoh hoh. It is simple. You have misheard her.",
            "Phoenix: I think not.",
            "Phoenix: Look at the floor plans...",
            "Phoenix: The killer was here.",
            "Phoenix: And the victim, here.",
            "Phoenix: If the victim ran to the left, as you claim she did...",
            "Phoenix: She would have been running directly away from the door!",
            "Phoenix: She would have been running into a dead end!",
            "Phoenix: Don't you find that odd?",
            "White: !",
            "White: Very strange...",
            "White: I did see her run to the left... I did.",
            "Maya: Phoenix... look at his face. I don't think he's lying about this one.",
            "Phoenix: True.",
            "Phoenix: (Maybe he really did see the victim run left...?)",
            "Phoenix: (So he did witness the killing...?)",
            "Phoenix: (Wait a second!)",
            "Judge: Mr. Wright?",
            "Phoenix: Yes, Your Honor?",
            "Judge: Miss May says \"right,\" and Mr. White says \"left.\"",
            "Judge: Can you explain this contradiction to the court?",
            "Phoenix: As Miss May has stated, Mia ran to the right after she was attacked.",
            "White: What is this? I am not fashioning fabrications, I assure you!",
            "White: That lady ran to the left! I am sure of it!",
            "Phoenix: Then there can be only one explanation.",
            "Edgeworth: Eh...? And that is?",
            "Phoenix: Obviously, the witness was not viewing the crime from the hotel!",
            "Judge: Mr. Wright! What do you m",
            "Edgeworth: Yes, what do you mean, he was not \"viewing the crime from the hotel\"!?",
            "Edgeworth: If he was not in the hotel, where could he have been!?",
            "Phoenix: In the law offices of Fey & Co., of course!"
        ],
        "evidences": [
            "ATTORNEY'S BADGE: No one would believe I was a defense attorney if I didn't carry this.. UI description: ** The evidence is a small, round, metallic object, likely made of gold or brass. It has a distinct, thick, ridged or fluted border that surrounds a central, raised emblem. This central emblem clearly depicts the balanced scales of justice symbol. The object has a polished, shiny appearance, with shading indicating its three-dimensional, disc-like shape.",
            "MIA'S AUTOPSY REPORT: Died from a blow by a blunt object. May have lived for a few minutes after being hit.. UI description: A standard-sized, light brown manila envelope is shown. It is sealed using a traditional string-and-button closure; two dark, circular buttons are visible on the flap and body, with a light-colored string wrapped around them. The envelope appears flat, likely containing papers, and shows no visible markings or damage.",
            "MAYA'S CELL PHONE: Holds a conversation between the Chief and Maya. (September 5, 9:27 AM. Maya: Mia! What's up? You haven't called in a while. Mia: Well, actually there's something I want you to hold on to for me. Maya: Again? What is it this time? Mia: It's... a clock. It's made to look like that statue, 'The Thinker.' And it tells you the time! Ah... I should probably tell you, the clock isn't talking right now. Maya: Huh? It's not working? That's lame! Mia: I had to take the clockwork out, sorry. I put some papers inside it instead. Maya: Papers? Is that the evidence, then? Mia: I'll leave that one up to your imagination. See you tonight at nine.). UI description: The evidence is a purple flip-style cell phone, shown in its open state. It features a dark grey screen and a silver keypad with numerous small buttons. A short antenna protrudes from the top right. Attached to the top left corner is a matching purple strap or lanyard. The phone appears to be made of plastic and shows no obvious damage.",
            "GLASS SHARDS: The broken remains of a glass light stand. Broken beyond all recognition.. UI description: The evidence icon displays several irregularly shaped, white fragments scattered against a plain grey background. The pieces vary in size, with some larger flat shards and smaller slivers. They have sharp, clearly broken edges. Highlights and subtle shading give them a slightly reflective appearance, consistent with broken glass.",
            "THE THINKER: The murder weapon. Looks like a statue, but it's actually a clock. Made by Larry Butz.. UI description: A small, metallic, bronze-colored statuette of a seated male figure resting his chin on his right hand, with his right elbow on his left knee. The figure sits atop an uneven surface, mimicking a rock. This entire sculpture is mounted on a plain, white, rectangular pedestal. On the front face of the white pedestal, there is a small, dark, horizontal rectangular indentation or slot.",
            "WIRETAP: Found in Miss May's hotel room.. UI description: The evidence displayed is a small, black, rectangular plastic-looking box. Extending from one side are two flexible black wires that loop back towards the box. Each wire ends with a small, distinct, gold-colored metallic tip or contact point. The main body of the box appears solid and smooth.",
            "RECEIPT: A department store receipt with letters written in blood on the back.. UI description: A small, roughly rectangular piece of white paper, appearing slightly crumpled or folded. On its surface, the name \"Maya\" is written in large, somewhat uneven letters using a thick, red substance that resembles blood. An exclamation mark follows the name, also rendered in the same red substance. The writing style looks somewhat rushed or erratic, and the red substance appears slightly smeared or absorbed into the paper. The edges of the paper are not perfectly straight.",
            "MAY TESTIMONY: \"The victim dodged an attack then ran to the right, but she was caught and struck.\". UI description: The evidence item is a long, narrow, rectangular object, primarily white in color. It appears to be made of paper and is folded lengthwise down the center. One end looks slightly thicker, as if another piece of paper is tucked inside or it's folded over multiple times. There are no visible markings, text, or damage on its surface.",
            "FLOOR PLANS: The murder scene, the Fey & Co. Law Offices.. UI description: The evidence depicted is a flat, slightly angled, square piece of paper or similar thin material. It has a large, light-grey central area with a noticeable white border surrounding it. The surface appears plain and unmarked, with a slight sheen suggesting it might be glossy or reflecting light."
        ],
        "prev_responses": [
            "game_state: Conversation\nmove: z\nthought: continue conversation",
            "game_state: Cross-Examination\nmove: down\nthought: The current selection is \"Mr. White is right\" but I need to navigate to the other options to find the correct one. Mr. White claimed the victim ran to the left, while Miss May said the victim ran to the right. Based on the floor plans and the logic of the situation, I need to consider which option makes the most sense. Moving to the next option \"Miss May is right\".",
            "game_state: Cross-Examination\nmove: z\nthought: I need to select the correct answer to explain the contradiction between Miss May's testimony (victim ran to the right) and Mr. White's testimony (victim ran to the left). The current selection is \"Miss May is right\" which appears to be the correct choice based on the floor plans evidence we've seen. The victim would logically run toward the door (to the right) rather than into a dead end (to the left). I'll confirm this selection.",
            "game_state: Conversation\nmove: z\nthought: continue conversation",
            "game_state: Conversation\nmove: z\nthought: continue conversation",
            "game_state: Conversation\nmove: z\nthought: continue conversation",
            "game_state: Conversation\nmove: z\nthought: continue conversation",
            "game_state: Conversation\nmove: z\nthought: continue conversation",
            "game_state: Conversation\nmove: z\nthought: continue conversation",
            "game_state: Conversation\nmove: z\nthought: continue conversation",
            "game_state: Conversation\nmove: z\nthought: continue conversation",
            "game_state: Conversation\nmove: z\nthought: continue conversation",
            "game_state: Conversation\nmove: z\nthought: continue conversation",
            "game_state: Conversation\nmove: z\nthought: continue conversation"
        ]
    }
}